.emacs.d/emacs.org
# -*- mode: org -*-
# -*- coding: utf-8 -*-

#+AUTHOR:    Luke Crook
#+EMAIL:     luke@balooga.com

#+TITLE:     Luke's .emacs file
#+DATE:      [2014-10-07 Tue]

#+DESCRIPTION: Initial initialization file created by Bill Clementson.
#+DESCRIPTION: Severely modified by Luke Crook.
#+DESCRIPTION: https://github.com/bzg/dotemacs/blob/master/emacs.org
* Introduction
** Desired Operation
On startup, Emacs loads the file =init.el= located in the =~/.emacs.d/= directory.  =init.el= specifies the path to the most recent version of [[http://org-mode.org][Org-Mode]], and instructs Emacs to load and run all the .org files in the =~/.emacs.d/= directory.

** Dependencies
1) Emacs, at least version 24.3

2) Org-Mode, at least version 8 installed in =~/site/org-mode=

3) The file =init.el= in the =~/.emacs.d/= directory.
   - Note 1 :: See Section "[[*.emacs.d/init.el][.emacs.d/init.el]]" for the contents of this file.
   - Note 1 :: The =~= (tilde character) shorthand command refers to the user's /HOME/ directory.
   - Note 2 :: If the latest version of Org-Mode is not installed in the location above, then Emacs will use an older version of Org-Mode that is distributed with Emacs.  If Org-Mode is installed in a directory other than =~/org-mode/=, then change the variable =org-dir= in "[[*.emacs.d/init.el][.emacs.d/init.el]]" appropriately.

4) This file (=emacs.org=) in the =~/.emacs.d/= directory.

5) A =themes= directory within =~/.emacs.d/=, i.e. =~/.emacs.d/themes/=

6) Download and install the free [[http://dejavu-fonts.org/wiki/Main_Page][DejaVu]] fonts for a better Emacs experience.

** .emacs.d/init.el
1) Create the file =.emacs.d/init.el=, and copy the following into it.

   #+begin_example
     ;;; http://orgmode.org/worg/org-contrib/babel/intro.html
     ;;; init.el --- Where all the magic begins
     ;;
     (defvar dotfiles-dir (file-name-directory (or (buffer-file-name)
                                                   load-file-name)))

     (defvar org-mode-path-name "~/site/org-mode")

     ;; Set the directory for the latest version of org-mode
     (defvar org-dir (expand-file-name org-mode-path-name ""))
     (defvar org/lisp-dir (expand-file-name "lisp" org-dir))
     (defvar org/contrib-dir (expand-file-name "contrib/lisp" org-dir))
     (add-to-list 'load-path org/lisp-dir)
     (add-to-list 'load-path org/contrib-dir t)

     (require 'org)
     (require 'org-install)
     (require 'ob-tangle)
     (require 'org-id)

     ;; Load up all literate org-mode files in this directory
     ;; In other words, load emacs.org
     (mapc #'org-babel-load-file 
           (list (expand-file-name "emacs.org" dotfiles-dir)))

     ;;; init.el ends here
   #+end_example

* Keys
** General & Help
| Key Chord | Description                             | Command           |
|-----------+-----------------------------------------+-------------------|
| C-g       | Cancel current command.                 | keyboard-quit     |
| C-c h ?   | Help commands                           |                   |
| C-c h v   | Describe Variable                       | describe-variable |
| C-c h f   | Describe Function                       | describe-function |
| C-c h k   | Describe function bound to key chord    | describe-key      |
| C-c h h   | How to say "Hello" in various languages |                   |

