.emacs.d/emacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Luke's .emacs file</title>
<!-- 2014-10-07 Tue 03:49 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Luke Crook" />
<meta  name="description" content="Initial initialization file created by Bill Clementson.
Severely modified by Luke Crook."
 />
</head>
<body>
<div id="content">
<h1 class="title">Luke's .emacs file</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a>
<ul>
<li><a href="#sec-1-1">1.1. Desired Operation</a></li>
<li><a href="#sec-1-2">1.2. Dependencies</a></li>
<li><a href="#sec-1-3">1.3. .emacs.d/init.el</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Keys</a>
<ul>
<li><a href="#sec-2-1">2.1. General &amp; Help</a></li>
<li><a href="#sec-2-2">2.2. Cursor Movement</a></li>
<li><a href="#sec-2-3">2.3. Editing Commands</a></li>
<li><a href="#sec-2-4">2.4. File manipulation</a></li>
<li><a href="#sec-2-5">2.5. Org-Mode commands</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Start timing .emacs load time</a></li>
<li><a href="#sec-4">4. Initial Code Load</a></li>
<li><a href="#sec-5">5. Set OS-specific Variables</a></li>
<li><a href="#sec-6">6. Set Paths</a>
<ul>
<li><a href="#sec-6-1">6.1. home, bin, site</a></li>
<li><a href="#sec-6-2">6.2. Hunspell</a></li>
<li><a href="#sec-6-3">6.3. exec/load paths</a></li>
<li><a href="#sec-6-4">6.4. Color Theme</a></li>
<li><a href="#sec-6-5">6.5. PlantUML</a></li>
<li><a href="#sec-6-6">6.6. Set the default directory</a></li>
<li><a href="#sec-6-7">6.7. Backup Path</a></li>
</ul>
</li>
<li><a href="#sec-7">7. Specify the Emacs Custom file</a></li>
<li><a href="#sec-8">8. System Customization</a>
<ul>
<li><a href="#sec-8-1">8.1. General Defaults</a></li>
<li><a href="#sec-8-2">8.2. UTF-8 Everywhere</a></li>
<li><a href="#sec-8-3">8.3. Debug</a></li>
<li><a href="#sec-8-4">8.4. Scrolling</a></li>
<li><a href="#sec-8-5">8.5. Menu Bar, Tool Bar &amp; Scroll Bars</a></li>
<li><a href="#sec-8-6">8.6. Recentf</a></li>
<li><a href="#sec-8-7">8.7. Uniquify Buffer Names</a></li>
<li><a href="#sec-8-8">8.8. Fonts</a></li>
<li><a href="#sec-8-9">8.9. Use Spaces for Tabulation</a></li>
<li><a href="#sec-8-10">8.10. Indicate Empty Lines</a></li>
<li><a href="#sec-8-11">8.11. Behaviour Within Buffers</a></li>
<li><a href="#sec-8-12">8.12. EOL Behaviour</a></li>
<li><a href="#sec-8-13">8.13. Scrolling</a></li>
<li><a href="#sec-8-14">8.14. Misc customizations</a></li>
<li><a href="#sec-8-15">8.15. Searching &amp; Highlighting</a></li>
<li><a href="#sec-8-16">8.16. Backups</a></li>
<li><a href="#sec-8-17">8.17. Auto-save</a></li>
<li><a href="#sec-8-18">8.18. Text Mark, Select, Copy, Paste &amp; Cut</a></li>
<li><a href="#sec-8-19">8.19. Cursor Colors</a></li>
<li><a href="#sec-8-20">8.20. Font Lock</a></li>
<li><a href="#sec-8-21">8.21. Dired Customization</a></li>
<li><a href="#sec-8-22">8.22. Modeline etc.</a></li>
<li><a href="#sec-8-23">8.23. Image Support</a></li>
<li><a href="#sec-8-24">8.24. Mouse Events</a></li>
<li><a href="#sec-8-25">8.25. Shells</a></li>
<li><a href="#sec-8-26">8.26. Window Management</a></li>
<li><a href="#sec-8-27">8.27. Define Keys</a>
<ul>
<li><a href="#sec-8-27-1">8.27.1. Global Keys</a></li>
<li><a href="#sec-8-27-2">8.27.2. Key Overrides</a></li>
</ul>
</li>
<li><a href="#sec-8-28">8.28. OSX Key Overrides</a></li>
<li><a href="#sec-8-29">8.29. OSX Customization</a></li>
<li><a href="#sec-8-30">8.30. Auto Completion</a></li>
<li><a href="#sec-8-31">8.31. Smart Home</a></li>
<li><a href="#sec-8-32">8.32. Common Lisp Editing</a>
<ul>
<li><a href="#sec-8-32-1">8.32.1. Associate ASDF File Extensions to Major Modes</a></li>
<li><a href="#sec-8-32-2">8.32.2. Paredit</a></li>
<li><a href="#sec-8-32-3">8.32.3. Highlighting Parenthesis</a></li>
</ul>
</li>
<li><a href="#sec-8-33">8.33. Naked Emacs</a></li>
<li><a href="#sec-8-34">8.34. Spelling</a></li>
<li><a href="#sec-8-35">8.35. Highlight cursor line</a></li>
</ul>
</li>
<li><a href="#sec-9">9. Version Control</a>
<ul>
<li><a href="#sec-9-1">9.1. Ediff</a></li>
<li><a href="#sec-9-2">9.2. Magit</a></li>
</ul>
</li>
<li><a href="#sec-10">10. Color Theme</a></li>
<li><a href="#sec-11">11. Mode-Line Customizations</a>
<ul>
<li><a href="#sec-11-1">11.1. Smart-Mode-Line</a></li>
<li><a href="#sec-11-2">11.2. Powerline</a></li>
</ul>
</li>
<li><a href="#sec-12">12. ORG-mode</a>
<ul>
<li><a href="#sec-12-1">12.1. Initial Code Load</a></li>
<li><a href="#sec-12-2">12.2. Loading TaskJuggler export backend</a></li>
<li><a href="#sec-12-3">12.3. Associate File Extensions to Major Modes</a></li>
<li><a href="#sec-12-4">12.4. Org-mode Key Bindings</a></li>
<li><a href="#sec-12-5">12.5. Babel</a></li>
<li><a href="#sec-12-6">12.6. Tag Customization</a></li>
<li><a href="#sec-12-7">12.7. Todo Customization</a></li>
<li><a href="#sec-12-8">12.8. Default TODO List</a></li>
<li><a href="#sec-12-9">12.9. Misc Customizations</a></li>
<li><a href="#sec-12-10">12.10. Fonts</a>
<ul>
<li><a href="#sec-12-10-1">12.10.1. Column View</a></li>
<li><a href="#sec-12-10-2">12.10.2. Tables</a></li>
</ul>
</li>
<li><a href="#sec-12-11">12.11. Spelling</a></li>
<li><a href="#sec-12-12">12.12. Document Generation</a>
<ul>
<li><a href="#sec-12-12-1">12.12.1. Custom LaTeX title page</a></li>
</ul>
</li>
<li><a href="#sec-12-13">12.13. Links</a></li>
<li><a href="#sec-12-14">12.14. Fontify source blocks in Latex</a></li>
<li><a href="#sec-12-15">12.15. Syntax highlight source blocks in the org buffer</a></li>
<li><a href="#sec-12-16">12.16. Set when Deadlines appear in Agenda view</a></li>
<li><a href="#sec-12-17">12.17. Delete the ID when cloning a subtree</a></li>
<li><a href="#sec-12-18">12.18. Allow alphabetical lists</a></li>
<li><a href="#sec-12-19">12.19. Log working time into a LOGBOOK drawer</a></li>
<li><a href="#sec-12-20">12.20. Function to return just the date of the most recent commit</a></li>
<li><a href="#sec-12-21">12.21. Hide Leading Stars</a></li>
<li><a href="#sec-12-22">12.22. Org-Reveal</a></li>
</ul>
</li>
<li><a href="#sec-13">13. Org Publishing</a>
<ul>
<li><a href="#sec-13-1">13.1. Jekyll configuration</a></li>
</ul>
</li>
<li><a href="#sec-14">14. Slime</a></li>
<li><a href="#sec-15">15. Startup Display</a>
<ul>
<li><a href="#sec-15-1">15.1. Maximize the Emacs Window on Startup</a></li>
<li><a href="#sec-15-2">15.2. Open a directory screen</a></li>
</ul>
</li>
<li><a href="#sec-16">16. End timing .emacs load time</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Desired Operation</h3>
<div class="outline-text-3" id="text-1-1">
<p>
On startup, Emacs loads the file <code>init.el</code> located in the <code>~/.emacs.d/</code> directory.  <code>init.el</code> specifies the path to the most recent version of <a href="http://org-mode.org">Org-Mode</a>, and instructs Emacs to load and run all the .org files in the <code>~/.emacs.d/</code> directory.
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Dependencies</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li>Emacs, at least version 24.3
</li>

<li>Org-Mode, at least version 8 installed in <code>~/site/org-mode</code>
</li>

<li>The file <code>init.el</code> in the <code>~/.emacs.d/</code> directory.
<dl class="org-dl">
<dt> Note 1 </dt><dd>See Section "<a href="#sec-1-3">.emacs.d/init.el</a>" for the contents of this file.
</dd>
<dt> Note 1 </dt><dd>The <code>~</code> (tilde character) shorthand command refers to the user's <i>HOME</i> directory.
</dd>
<dt> Note 2 </dt><dd>If the latest version of Org-Mode is not installed in the location above, then Emacs will use an older version of Org-Mode that is distributed with Emacs.  If Org-Mode is installed in a directory other than <code>~/org-mode/</code>, then change the variable <code>org-dir</code> in "<a href="#sec-1-3">.emacs.d/init.el</a>" appropriately.
</dd>
</dl>
</li>

<li>This file (<code>emacs.org</code>) in the <code>~/.emacs.d/</code> directory.
</li>

<li>A <code>themes</code> directory within <code>~/.emacs.d/</code>, i.e. <code>~/.emacs.d/themes/</code>
</li>

<li>Download and install the free <a href="http://dejavu-fonts.org/wiki/Main_Page">DejaVu</a> fonts for a better Emacs experience.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> .emacs.d/init.el</h3>
<div class="outline-text-3" id="text-1-3">
<ol class="org-ol">
<li>Create the file <code>.emacs.d/init.el</code>, and copy the following into it.

<pre class="example">
;;; http://orgmode.org/worg/org-contrib/babel/intro.html
;;; init.el --- Where all the magic begins
;;
(defvar dotfiles-dir (file-name-directory (or (buffer-file-name)
                                              load-file-name)))

(defvar org-mode-path-name "~/site/org-mode")

;; Set the directory for the latest version of org-mode
(defvar org-dir (expand-file-name org-mode-path-name ""))
(defvar org/lisp-dir (expand-file-name "lisp" org-dir))
(defvar org/contrib-dir (expand-file-name "contrib/lisp" org-dir))
(add-to-list 'load-path org/lisp-dir)
(add-to-list 'load-path org/contrib-dir t)

(require 'org)
(require 'org-install)
(require 'ob-tangle)
(require 'org-id)

;; Load up all literate org-mode files in this directory
;; In other words, load emacs.org
(mapc #'org-babel-load-file 
      (list (expand-file-name "emacs.org" dotfiles-dir)))

;;; init.el ends here
</pre>
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Keys</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> General &amp; Help</h3>
<div class="outline-text-3" id="text-2-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Key Chord</th>
<th scope="col" class="left">Description</th>
<th scope="col" class="left">Command</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">C-g</td>
<td class="left">Cancel current command.</td>
<td class="left">keyboard-quit</td>
</tr>

<tr>
<td class="left">C-c h ?</td>
<td class="left">Help commands</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">C-c h v</td>
<td class="left">Describe Variable</td>
<td class="left">describe-variable</td>
</tr>

<tr>
<td class="left">C-c h f</td>
<td class="left">Describe Function</td>
<td class="left">describe-function</td>
</tr>

<tr>
<td class="left">C-c h k</td>
<td class="left">Describe function bound to key chord</td>
<td class="left">describe-key</td>
</tr>

<tr>
<td class="left">C-c h h</td>
<td class="left">How to say "Hello" in various languages</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
