.emacs.d/emacs.org
** Cursor Movement
| Key Chord | Description                           | Command                                   |
|-----------+---------------------------------------+-------------------------------------------|
| C-f       | Forward one char                      | forward-char                              |
| C-b       | Backward one char                     | backward-char                             |
| M-f       | Forward word                          | forward-word                              |
| M-b       | Backward word                         | backward-word                             |
| M-e       | End of sentence, or table field       | org-forward-sentence / forward-sentence   |
| M-a       | Beginning of sentence, or table field | org-backward-sentence / backward-sentence |
| C-a       | Beginning of line                     | org-beginning-of-line                     |
| C-e       | End of line                           | org-end-of-line                           |
|           |                                       |                                           |
| C-p       | Up to previous line                   | previous-line                             |
| C-n       | Down to next line                     | next-line                                 |
| C-v       | Scroll screen down                    | cua-scroll-up                             |
| M-v       | Scroll screen up                      | cua-scroll-down                           |
| M->       | End of file                           | end-of-buffer                             |
| M-<       | Top of file                           | beginning-of-buffer                       |
| C-l       | Re-center screen on current line      | recenter-top-bottom                       |

** Editing Commands
| Key Chord      | Description                              | Command                   |
|----------------+------------------------------------------+---------------------------|
| C-z            | Undo                                     | undo                      |
| M-y            | Copy                                     | kill-ring-save            |
| M-y            | Paste                                    | cua-paste-pop / cua-paste |
| C-y            | Cut or "Yank" (not the American)         | org-yank                  |
|                |                                          |                           |
| C-h, BACKSPACE | Delete previous character                | org-delete-backward-char  |
| C-d, DEL       | Delete character forwards                | org-delete-char           |
| C-w            | Delete previous word                     | backward-kill-word        |
| M-d            | Delete forward word                      | kill-word                 |
| C-k            | Delete forward rest of line from cursor  | org-kill-line / kill-line |
|                |                                          |                           |
| M-c            | Capitalize word                          | capitalize-word           |
| M-u            | Uppercase word                           | upcase-word               |
|                |                                          |                           |
| C-q            | Read next input character and insert it. | quoted-insert             |

** File manipulation
| Key Chord | Description                                       | Command            |
|-----------+---------------------------------------------------+--------------------|
| C-x f     | List recently opened files                        | recentf-open-files |
| C-x C-f   | Open or create a file                             |                    |
| C-x C-v   | Replace buffer with a different file              |                    |
| C-x i     | Insert file at current cursor position            |                    |
| C-x C-s   | Save buffer to file                               |                    |
| C-x s     | Save all changed buffers.                         |                    |
| C-x C-w   | Write buffer to file (will prompt for file name). |                    |
| C-x C-c   | Save buffers and exit emacs                       |                    |
| C-x d     | Start [[http://www.gnu.org/software/emacs/manual/html_node/emacs/Dired.html][dired]].  File/directory management           | dired              |

** Org-Mode commands

* Start timing .emacs load time
#+BEGIN_SRC emacs-lisp
(defvar *emacs-load-start* (current-time))
#+END_SRC

* Initial Code Load
#+begin_src emacs-lisp
  (require 'cl)
  (require 'browse-url)
#+end_src

* Set OS-specific Variables 
# See if we're on MS Windows or some other OS
#+begin_src emacs-lisp
  (defvar mswindows-p (string-equal "windows" (symbol-name system-type)))
  (defvar macosx-p (string-equal "darwin" (symbol-name system-type)))
  (defvar gnu/linux-p (string-equal "gnu/linux" (symbol-name system-type)))
#+end_src

* Set Paths
