.emacs.d/emacs.html

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Cursor Movement</h3>
<div class="outline-text-3" id="text-2-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Key Chord</th>
<th scope="col" class="left">Description</th>
<th scope="col" class="left">Command</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">C-f</td>
<td class="left">Forward one char</td>
<td class="left">forward-char</td>
</tr>

<tr>
<td class="left">C-b</td>
<td class="left">Backward one char</td>
<td class="left">backward-char</td>
</tr>

<tr>
<td class="left">M-f</td>
<td class="left">Forward word</td>
<td class="left">forward-word</td>
</tr>

<tr>
<td class="left">M-b</td>
<td class="left">Backward word</td>
<td class="left">backward-word</td>
</tr>

<tr>
<td class="left">M-e</td>
<td class="left">End of sentence, or table field</td>
<td class="left">org-forward-sentence / forward-sentence</td>
</tr>

<tr>
<td class="left">M-a</td>
<td class="left">Beginning of sentence, or table field</td>
<td class="left">org-backward-sentence / backward-sentence</td>
</tr>

<tr>
<td class="left">C-a</td>
<td class="left">Beginning of line</td>
<td class="left">org-beginning-of-line</td>
</tr>

<tr>
<td class="left">C-e</td>
<td class="left">End of line</td>
<td class="left">org-end-of-line</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">C-p</td>
<td class="left">Up to previous line</td>
<td class="left">previous-line</td>
</tr>

<tr>
<td class="left">C-n</td>
<td class="left">Down to next line</td>
<td class="left">next-line</td>
</tr>

<tr>
<td class="left">C-v</td>
<td class="left">Scroll screen down</td>
<td class="left">cua-scroll-up</td>
</tr>

<tr>
<td class="left">M-v</td>
<td class="left">Scroll screen up</td>
<td class="left">cua-scroll-down</td>
</tr>

<tr>
<td class="left">M-&gt;</td>
<td class="left">End of file</td>
<td class="left">end-of-buffer</td>
</tr>

<tr>
<td class="left">M-&lt;</td>
<td class="left">Top of file</td>
<td class="left">beginning-of-buffer</td>
</tr>

<tr>
<td class="left">C-l</td>
<td class="left">Re-center screen on current line</td>
<td class="left">recenter-top-bottom</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Editing Commands</h3>
<div class="outline-text-3" id="text-2-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Key Chord</th>
<th scope="col" class="left">Description</th>
<th scope="col" class="left">Command</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">C-z</td>
<td class="left">Undo</td>
<td class="left">undo</td>
</tr>

<tr>
<td class="left">M-y</td>
<td class="left">Copy</td>
<td class="left">kill-ring-save</td>
</tr>

<tr>
<td class="left">M-y</td>
<td class="left">Paste</td>
<td class="left">cua-paste-pop / cua-paste</td>
</tr>

<tr>
<td class="left">C-y</td>
<td class="left">Cut or "Yank" (not the American)</td>
<td class="left">org-yank</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">C-h, BACKSPACE</td>
<td class="left">Delete previous character</td>
<td class="left">org-delete-backward-char</td>
</tr>

<tr>
<td class="left">C-d, DEL</td>
<td class="left">Delete character forwards</td>
<td class="left">org-delete-char</td>
</tr>

<tr>
<td class="left">C-w</td>
<td class="left">Delete previous word</td>
<td class="left">backward-kill-word</td>
</tr>

<tr>
<td class="left">M-d</td>
<td class="left">Delete forward word</td>
<td class="left">kill-word</td>
</tr>

<tr>
<td class="left">C-k</td>
<td class="left">Delete forward rest of line from cursor</td>
<td class="left">org-kill-line / kill-line</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">M-c</td>
<td class="left">Capitalize word</td>
<td class="left">capitalize-word</td>
</tr>

<tr>
<td class="left">M-u</td>
<td class="left">Uppercase word</td>
<td class="left">upcase-word</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">C-q</td>
<td class="left">Read next input character and insert it.</td>
<td class="left">quoted-insert</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> File manipulation</h3>
<div class="outline-text-3" id="text-2-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Key Chord</th>
<th scope="col" class="left">Description</th>
<th scope="col" class="left">Command</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">C-x f</td>
<td class="left">List recently opened files</td>
<td class="left">recentf-open-files</td>
</tr>

<tr>
<td class="left">C-x C-f</td>
<td class="left">Open or create a file</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">C-x C-v</td>
<td class="left">Replace buffer with a different file</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">C-x i</td>
<td class="left">Insert file at current cursor position</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">C-x C-s</td>
<td class="left">Save buffer to file</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">C-x s</td>
<td class="left">Save all changed buffers.</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">C-x C-w</td>
<td class="left">Write buffer to file (will prompt for file name).</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">C-x C-c</td>
<td class="left">Save buffers and exit emacs</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">C-x d</td>
<td class="left">Start <a href="http://www.gnu.org/software/emacs/manual/html_node/emacs/Dired.html">dired</a>.  File/directory management</td>
<td class="left">dired</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> Org-Mode commands</h3>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Start timing .emacs load time</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defvar</span> <span style="color: #DFAF8F;">*emacs-load-start*</span> <span style="color: #BFEBBF;">(</span>current-time<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Initial Code Load</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">require</span> '<span style="color: #BFEBBF;">cl</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">require</span> '<span style="color: #BFEBBF;">browse-url</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Set OS-specific Variables</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defvar</span> <span style="color: #DFAF8F;">mswindows-p</span> <span style="color: #BFEBBF;">(</span>string-equal <span style="color: #CC9393;">"windows"</span> <span style="color: #D0BF8F;">(</span>symbol-name system-type<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defvar</span> <span style="color: #DFAF8F;">macosx-p</span> <span style="color: #BFEBBF;">(</span>string-equal <span style="color: #CC9393;">"darwin"</span> <span style="color: #D0BF8F;">(</span>symbol-name system-type<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defvar</span> <span style="color: #DFAF8F;">gnu/linux-p</span> <span style="color: #BFEBBF;">(</span>string-equal <span style="color: #CC9393;">"gnu/linux"</span> <span style="color: #D0BF8F;">(</span>symbol-name system-type<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
