.emacs.d/emacs.el

(defvar *emacs-load-start* (current-time))

(require 'cl)
(require 'browse-url)

(defvar mswindows-p (string-equal "windows" (symbol-name system-type)))
(defvar macosx-p (string-equal "darwin" (symbol-name system-type)))
(defvar gnu/linux-p (string-equal "gnu/linux" (symbol-name system-type)))
