.emacs.d/emacs.html

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Set Paths</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> home, bin, site</h3>
<div class="outline-text-3" id="text-6-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defvar</span> <span style="color: #DFAF8F;">use-home</span> <span style="color: #BFEBBF;">(</span>expand-file-name <span style="color: #CC9393;">"~"</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defvar</span> <span style="color: #DFAF8F;">use-home/site</span> <span style="color: #BFEBBF;">(</span>expand-file-name <span style="color: #CC9393;">"site"</span> use-home<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defvar</span> <span style="color: #DFAF8F;">use-home/bin</span> <span style="color: #BFEBBF;">(</span>expand-file-name <span style="color: #CC9393;">"bin"</span> use-home<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>

<span style="color: #DCDCCC;">(</span>add-to-list 'load-path use-home<span style="color: #DCDCCC;">)</span>  
<span style="color: #DCDCCC;">(</span>add-to-list 'load-path use-home/site<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>add-to-list 'load-path use-home/bin<span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> Hunspell</h3>
<div class="outline-text-3" id="text-6-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #5F7F5F;">;;</span><span style="color: #7F9F7F;">Replace the default Ispell dictionary with "Hunspell"</span>
<span style="color: #5F7F5F;">;;</span><span style="color: #7F9F7F;">http://hunspell.sourceforge.net/</span>
<span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defvar</span> <span style="color: #DFAF8F;">use-hunspell</span> 
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">when</span> <span style="color: #D0BF8F;">(</span>file-directory-p <span style="color: #93E0E3;">(</span>expand-file-name <span style="color: #CC9393;">"hunspell"</span> use-home/site<span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span>expand-file-name <span style="color: #CC9393;">"hunspell"</span> use-home/site<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> exec/load paths</h3>
<div class="outline-text-3" id="text-6-3">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Add Windows paths to exec-path</span>
<span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">when</span> mswindows-p
  <span style="color: #BFEBBF;">(</span>add-to-list 'exec-path <span style="color: #D0BF8F;">(</span>expand-file-name <span style="color: #CC9393;">"bin"</span> <span style="color: #93E0E3;">(</span>getenv <span style="color: #CC9393;">"EMACS_DIR"</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>add-to-list 'exec-path <span style="color: #CC9393;">"C:/Windows/system32"</span><span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>add-to-list 'exec-path <span style="color: #CC9393;">"C:/Windows"</span><span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>add-to-list 'exec-path <span style="color: #CC9393;">"C:/Program Files (x86)/Git/bin"</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>

<span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">(setenv "PATH" (concat (getenv "PATH") hunspell-path))</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Only set the path if it exists</span>
<span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">when</span> use-hunspell
  <span style="color: #BFEBBF;">(</span>add-to-list 'exec-path <span style="color: #D0BF8F;">(</span>expand-file-name <span style="color: #CC9393;">"bin"</span> use-hunspell<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Check if path exists prior to adding to 'load-path</span>
<span style="color: #DCDCCC;">(</span>mapc <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">lambda</span> <span style="color: #D0BF8F;">(</span>arg<span style="color: #D0BF8F;">)</span>
       <span style="color: #D0BF8F;">(</span><span style="color: #F0DFAF; font-weight: bold;">when</span> <span style="color: #93E0E3;">(</span>file-directory-p arg<span style="color: #93E0E3;">)</span>
         <span style="color: #93E0E3;">(</span>add-to-list 'load-path arg<span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span>
     <span style="color: #BFEBBF;">(</span>list
      <span style="color: #D0BF8F;">(</span>expand-file-name <span style="color: #CC9393;">"slime-master"</span> use-home/site<span style="color: #D0BF8F;">)</span>
      <span style="color: #D0BF8F;">(</span>expand-file-name <span style="color: #CC9393;">"auto-complete-master"</span> use-home/site<span style="color: #D0BF8F;">)</span>
      <span style="color: #D0BF8F;">(</span>expand-file-name <span style="color: #CC9393;">"popup-el-master"</span> use-home/site<span style="color: #D0BF8F;">)</span>
      <span style="color: #D0BF8F;">(</span>expand-file-name <span style="color: #CC9393;">"parenface-master"</span> use-home/site<span style="color: #D0BF8F;">)</span>
      <span style="color: #D0BF8F;">(</span>expand-file-name <span style="color: #CC9393;">"emacs-color-theme-solarized-master"</span> use-home/site<span style="color: #D0BF8F;">)</span>
      <span style="color: #D0BF8F;">(</span>expand-file-name <span style="color: #CC9393;">"dash.el-master"</span> use-home/site<span style="color: #D0BF8F;">)</span>
      <span style="color: #D0BF8F;">(</span>expand-file-name <span style="color: #CC9393;">"smart-mode-line-master"</span> use-home/site<span style="color: #D0BF8F;">)</span>
      <span style="color: #D0BF8F;">(</span>expand-file-name <span style="color: #CC9393;">"powerline-master"</span> use-home/site<span style="color: #D0BF8F;">)</span>
      <span style="color: #D0BF8F;">(</span>expand-file-name <span style="color: #CC9393;">"company-mode-master"</span> use-home/site<span style="color: #D0BF8F;">)</span>
      <span style="color: #D0BF8F;">(</span>expand-file-name <span style="color: #CC9393;">"git-modes-master"</span> use-home/site<span style="color: #D0BF8F;">)</span>
      <span style="color: #D0BF8F;">(</span>expand-file-name <span style="color: #CC9393;">"magit-master"</span> use-home/site<span style="color: #D0BF8F;">)</span>
      <span style="color: #D0BF8F;">(</span>expand-file-name <span style="color: #CC9393;">"git-modes-master"</span> use-home/site<span style="color: #D0BF8F;">)</span>
      <span style="color: #D0BF8F;">(</span>expand-file-name <span style="color: #CC9393;">"rich-minority-master"</span> use-home/site<span style="color: #D0BF8F;">)</span>
      <span style="color: #D0BF8F;">(</span>expand-file-name <span style="color: #CC9393;">"rainbow-delimiters-master"</span> use-home/site<span style="color: #D0BF8F;">)</span>
      <span style="color: #D0BF8F;">(</span>expand-file-name <span style="color: #CC9393;">"highlight-sexp-master"</span> use-home/site<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">See https://github.com/aki2o/org-ac</span>
<span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">(add-to-list 'load-path (expand-file-name "auto-complete-pcmp" use-home/site))</span>
<span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">(add-to-list 'load-path (expand-file-name "log4e" use-home/site))</span>
<span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">(add-to-list 'load-path (expand-file-name "org-ac" use-home/site))</span>
<span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">(add-to-list 'load-path (expand-file-name "yaxception" use-home/site))</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-6-4" class="outline-3">
<h3 id="sec-6-4"><span class="section-number-3">6.4</span> Color Theme</h3>
<div class="outline-text-3" id="text-6-4">
<div class="org-src-container">

<pre class="src src-emacs-lisp">  <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Color theme</span>
<span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">let</span> <span style="color: #BFEBBF;">(</span><span style="color: #D0BF8F;">(</span>dir <span style="color: #93E0E3;">(</span>expand-file-name <span style="color: #CC9393;">"themes"</span> dotfiles-dir<span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">when</span> <span style="color: #D0BF8F;">(</span>file-directory-p dir<span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span>add-to-list 'custom-theme-load-path dir<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
