.emacs.d/emacs.el

(defvar use-home (expand-file-name "~"))
(defvar use-home/site (expand-file-name "site" use-home))
(defvar use-home/bin (expand-file-name "bin" use-home))

(add-to-list 'load-path use-home)  
(add-to-list 'load-path use-home/site)
(add-to-list 'load-path use-home/bin)

;;Replace the default Ispell dictionary with "Hunspell"
;;http://hunspell.sourceforge.net/
(defvar use-hunspell 
  (when (file-directory-p (expand-file-name "hunspell" use-home/site))
    (expand-file-name "hunspell" use-home/site)))

;; Add Windows paths to exec-path
(when mswindows-p
  (add-to-list 'exec-path (expand-file-name "bin" (getenv "EMACS_DIR")))
  (add-to-list 'exec-path "C:/Windows/system32")
  (add-to-list 'exec-path "C:/Windows")
  (add-to-list 'exec-path "C:/Program Files (x86)/Git/bin"))

;(setenv "PATH" (concat (getenv "PATH") hunspell-path))
;; Only set the path if it exists
(when use-hunspell
  (add-to-list 'exec-path (expand-file-name "bin" use-hunspell)))

;; Check if path exists prior to adding to 'load-path
(mapc (lambda (arg)
       (when (file-directory-p arg)
         (add-to-list 'load-path arg)))
     (list
      (expand-file-name "slime-master" use-home/site)
      (expand-file-name "auto-complete-master" use-home/site)
      (expand-file-name "popup-el-master" use-home/site)
      (expand-file-name "parenface-master" use-home/site)
      (expand-file-name "emacs-color-theme-solarized-master" use-home/site)
      (expand-file-name "dash.el-master" use-home/site)
      (expand-file-name "smart-mode-line-master" use-home/site)
      (expand-file-name "powerline-master" use-home/site)
      (expand-file-name "company-mode-master" use-home/site)
      (expand-file-name "git-modes-master" use-home/site)
      (expand-file-name "magit-master" use-home/site)
      (expand-file-name "git-modes-master" use-home/site)
      (expand-file-name "rich-minority-master" use-home/site)
      (expand-file-name "rainbow-delimiters-master" use-home/site)
      (expand-file-name "highlight-sexp-master" use-home/site)))

;; See https://github.com/aki2o/org-ac
;(add-to-list 'load-path (expand-file-name "auto-complete-pcmp" use-home/site))
;(add-to-list 'load-path (expand-file-name "log4e" use-home/site))
;(add-to-list 'load-path (expand-file-name "org-ac" use-home/site))
;(add-to-list 'load-path (expand-file-name "yaxception" use-home/site))

;; Color theme
(let ((dir (expand-file-name "themes" dotfiles-dir)))
  (when (file-directory-p dir)
    (add-to-list 'custom-theme-load-path dir)))
