.emacs.d/emacs.org
** PlantUML
#+begin_src emacs-lisp
  (defvar org-plantuml-jar-path 
    (when (file-exists-p (expand-file-name "plantuml.jar" use-home/site))
      (expand-file-name "plantuml.jar" use-home/site)))
#+end_src

** Set the default directory
#+begin_src emacs-lisp
  (setq default-directory use-home)
#+end_src

** Backup Path
Backups are disabled, per Section "[[*Backups][Backups]]".
#+begin_src emacs-lisp
  ;; Specify where backup files are stored
  ;; Backups have to be enabled
  (setq backup-directory-alist (quote ((".*" . "~/.backups"))))
#+end_src

* Specify the Emacs Custom file
Location to store variables modified by the Emacs "customize" command.
#+BEGIN_SRC emacs-lisp
(setq custom-file (expand-file-name ".emacs-custom.el" dotfiles-dir))
(load custom-file 'noerror)
#+END_SRC

* System Customization
** General Defaults
#+BEGIN_SRC emacs-lisp

;; Let's get a backtrace when errors are
(setq debug-on-error t)

;; Scrolling done right
(setq scroll-error-top-bottom t)

;; Display byte-compiler warnings on error
(setq byte-compile-debug t)

;; Well, it's more so that you know this option
(setq kill-ring-max 120)
(setq kill-whole-line t)
(setq kill-read-only-ok t)

;; Tooltips
(tooltip-mode -1)
(setq tooltip-delay 3.0)

;; Sentences
(setq sentence-end-double-space t)
(setq require-final-newline t)

;; Number of lines of continuity when scrolling by screenfuls.
(setq next-screen-context-lines 0)

;; (setq bidi-display-reordering nil)
(setq enable-local-variables t)
(setq enable-local-eval t)

;replace y-e-s by y
(fset 'yes-or-no-p 'y-or-n-p)

;;(setenv "EDITOR" "emacsclient")
;;(setenv "CVS_RSH" "ssh")
#+END_SRC

** UTF-8 Everywhere
#+BEGIN_SRC emacs-lisp
;; Set UTF-8 as the defaut encoding
(set-terminal-coding-system    'utf-8)
(set-keyboard-coding-system    'utf-8)
(set-buffer-file-coding-system 'utf-8)
(setq org-export-coding-system 'utf-8)

(prefer-coding-system 'utf-8)
(set-charset-priority 'unicode)
(setq default-process-coding-system '(utf-8-unix . utf-8-unix))
#+END_SRC

** Debug
#+BEGIN_SRC emacs-lisp

#+END_SRC
** Scrolling
#+BEGIN_SRC emacs-lisp
  ;; ;;Smooth keyboard scrolling
  ;; (setq
  ;;  redisplay-dont-pause t                 ;; scrolling
  ;;  scroll-step 1                          ;; scroll line per line (1 line instead of 3)
  ;;  scroll-margin 0                        ;; do smooth scrolling, ...
  ;;  scroll-conservatively 100000           ;; ... the defaults ...
  ;;  scroll-up-aggressively 0               ;; ... are very ...
  ;;  scroll-down-aggressively 0             ;; ... annoying
  ;;  auto-window-vscroll nil)
#+END_SRC

** Menu Bar, Tool Bar & Scroll Bars
The Tool Bar, Menu Bar, and Scroll Bar can be disabled or enabled within Emacs as follows;

1) Enter \keys{\Alt + x} =customize= (Alt-x =customize=), and
2) Search for and enable or disable the /Menu Bar/, /Scroll Bar/ & /Tool Bar/.
3) Apply and save changes.
   
To change the color theme;

1) Enter \keys{\Alt + x} =customize-themes= (Alt-x =customize-themes=), and
2) Choose a theme from the list of available themes.
3) Apply and save changes.

** Recentf
Add recently edited files to a menu.
#+begin_src emacs-lisp
  (require 'recentf)
  (recentf-mode 1)                      
#+end_src

