.emacs.d/emacs.html

<div id="outline-container-sec-6-5" class="outline-3">
<h3 id="sec-6-5"><span class="section-number-3">6.5</span> PlantUML</h3>
<div class="outline-text-3" id="text-6-5">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defvar</span> <span style="color: #DFAF8F;">org-plantuml-jar-path</span> 
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">when</span> <span style="color: #D0BF8F;">(</span>file-exists-p <span style="color: #93E0E3;">(</span>expand-file-name <span style="color: #CC9393;">"plantuml.jar"</span> use-home/site<span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span>expand-file-name <span style="color: #CC9393;">"plantuml.jar"</span> use-home/site<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-6-6" class="outline-3">
<h3 id="sec-6-6"><span class="section-number-3">6.6</span> Set the default directory</h3>
<div class="outline-text-3" id="text-6-6">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span>setq default-directory use-home<span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-6-7" class="outline-3">
<h3 id="sec-6-7"><span class="section-number-3">6.7</span> Backup Path</h3>
<div class="outline-text-3" id="text-6-7">
<p>
Backups are disabled, per Section "<a href="#sec-8-16">Backups</a>".
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Specify where backup files are stored</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Backups have to be enabled</span>
<span style="color: #DCDCCC;">(</span>setq backup-directory-alist <span style="color: #BFEBBF;">(</span>quote <span style="color: #D0BF8F;">(</span><span style="color: #93E0E3;">(</span><span style="color: #CC9393;">".*"</span> . <span style="color: #CC9393;">"~/.backups"</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Specify the Emacs Custom file</h2>
<div class="outline-text-2" id="text-7">
<p>
Location to store variables modified by the Emacs "customize" command.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span>setq custom-file <span style="color: #BFEBBF;">(</span>expand-file-name <span style="color: #CC9393;">".emacs-custom.el"</span> dotfiles-dir<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>load custom-file 'noerror<span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> System Customization</h2>
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-sec-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> General Defaults</h3>
<div class="outline-text-3" id="text-8-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Let's get a backtrace when errors are</span>
<span style="color: #DCDCCC;">(</span>setq debug-on-error t<span style="color: #DCDCCC;">)</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Scrolling done right</span>
<span style="color: #DCDCCC;">(</span>setq scroll-error-top-bottom t<span style="color: #DCDCCC;">)</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Display byte-compiler warnings on error</span>
<span style="color: #DCDCCC;">(</span>setq byte-compile-debug t<span style="color: #DCDCCC;">)</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Well, it's more so that you know this option</span>
<span style="color: #DCDCCC;">(</span>setq kill-ring-max 120<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>setq kill-whole-line t<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>setq kill-read-only-ok t<span style="color: #DCDCCC;">)</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Tooltips</span>
<span style="color: #DCDCCC;">(</span>tooltip-mode -1<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>setq tooltip-delay 3.0<span style="color: #DCDCCC;">)</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Sentences</span>
<span style="color: #DCDCCC;">(</span>setq sentence-end-double-space t<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>setq require-final-newline t<span style="color: #DCDCCC;">)</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Number of lines of continuity when scrolling by screenfuls.</span>
<span style="color: #DCDCCC;">(</span>setq next-screen-context-lines 0<span style="color: #DCDCCC;">)</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">(setq bidi-display-reordering nil)</span>
<span style="color: #DCDCCC;">(</span>setq enable-local-variables t<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>setq enable-local-eval t<span style="color: #DCDCCC;">)</span>

<span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">replace y-e-s by y</span>
<span style="color: #DCDCCC;">(</span>fset 'yes-or-no-p 'y-or-n-p<span style="color: #DCDCCC;">)</span>

<span style="color: #5F7F5F;">;;</span><span style="color: #7F9F7F;">(setenv "EDITOR" "emacsclient")</span>
<span style="color: #5F7F5F;">;;</span><span style="color: #7F9F7F;">(setenv "CVS_RSH" "ssh")</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-8-2" class="outline-3">
<h3 id="sec-8-2"><span class="section-number-3">8.2</span> UTF-8 Everywhere</h3>
<div class="outline-text-3" id="text-8-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Set UTF-8 as the defaut encoding</span>
<span style="color: #DCDCCC;">(</span>set-terminal-coding-system    'utf-8<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>set-keyboard-coding-system    'utf-8<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>set-buffer-file-coding-system 'utf-8<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>setq org-export-coding-system 'utf-8<span style="color: #DCDCCC;">)</span>

<span style="color: #DCDCCC;">(</span>prefer-coding-system 'utf-8<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>set-charset-priority 'unicode<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>setq default-process-coding-system '<span style="color: #BFEBBF;">(</span>utf-8-unix . utf-8-unix<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-8-3" class="outline-3">
<h3 id="sec-8-3"><span class="section-number-3">8.3</span> Debug</h3>
<div class="outline-text-3" id="text-8-3">
<div class="org-src-container">

<pre class="src src-emacs-lisp"></pre>
</div>
</div>
</div>
<div id="outline-container-sec-8-4" class="outline-3">
<h3 id="sec-8-4"><span class="section-number-3">8.4</span> Scrolling</h3>
<div class="outline-text-3" id="text-8-4">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #5F7F5F;">;;</span><span style="color: #7F9F7F;">Smooth keyboard scrolling</span>
<span style="color: #DCDCCC;">(</span>setq
 redisplay-dont-pause t                 <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">scrolling</span>
 scroll-step 1                          <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">scroll line per line (1 line instead of 3)</span>
 scroll-margin 0                        <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">do smooth scrolling, ...</span>
 scroll-conservatively 100000           <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">... the defaults ...</span>
 scroll-up-aggressively 0               <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">... are very ...</span>
 scroll-down-aggressively 0             <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">... annoying</span>
 auto-window-vscroll nil<span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-8-5" class="outline-3">
<h3 id="sec-8-5"><span class="section-number-3">8.5</span> Menu Bar, Tool Bar &amp; Scroll Bars</h3>
<div class="outline-text-3" id="text-8-5">
<p>
The Tool Bar, Menu Bar, and Scroll Bar can be disabled or enabled within Emacs as follows;
</p>

<ol class="org-ol">
<li>Enter \keys{\Alt + x} <code>customize</code> (Alt-x <code>customize</code>), and
</li>
<li>Search for and enable or disable the <i>Menu Bar</i>, <i>Scroll Bar</i> &amp; <i>Tool Bar</i>.
</li>
<li>Apply and save changes.
</li>
</ol>

<p>
To change the color theme;
</p>

<ol class="org-ol">
<li>Enter \keys{\Alt + x} <code>customize-themes</code> (Alt-x <code>customize-themes</code>), and
</li>
<li>Choose a theme from the list of available themes.
</li>
<li>Apply and save changes.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-8-6" class="outline-3">
<h3 id="sec-8-6"><span class="section-number-3">8.6</span> Recentf</h3>
<div class="outline-text-3" id="text-8-6">
<p>
Add recently edited files to a menu.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">require</span> '<span style="color: #BFEBBF;">recentf</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>recentf-mode 1<span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
