.emacs.d/emacs.el

(defvar org-plantuml-jar-path 
  (when (file-exists-p (expand-file-name "plantuml.jar" use-home/site))
    (expand-file-name "plantuml.jar" use-home/site)))

(setq default-directory use-home)

;; Specify where backup files are stored
;; Backups have to be enabled
(setq backup-directory-alist (quote ((".*" . "~/.backups"))))

(setq custom-file (expand-file-name ".emacs-custom.el" dotfiles-dir))
(load custom-file 'noerror)

;; Let's get a backtrace when errors are
(setq debug-on-error t)

;; Scrolling done right
(setq scroll-error-top-bottom t)

;; Display byte-compiler warnings on error
(setq byte-compile-debug t)

;; Well, it's more so that you know this option
(setq kill-ring-max 120)
(setq kill-whole-line t)
(setq kill-read-only-ok t)

;; Tooltips
(tooltip-mode -1)
(setq tooltip-delay 3.0)

;; Sentences
(setq sentence-end-double-space t)
(setq require-final-newline t)

;; Number of lines of continuity when scrolling by screenfuls.
(setq next-screen-context-lines 0)

;; (setq bidi-display-reordering nil)
(setq enable-local-variables t)
(setq enable-local-eval t)

;replace y-e-s by y
(fset 'yes-or-no-p 'y-or-n-p)

;;(setenv "EDITOR" "emacsclient")
;;(setenv "CVS_RSH" "ssh")

;; Set UTF-8 as the defaut encoding
(set-terminal-coding-system    'utf-8)
(set-keyboard-coding-system    'utf-8)
(set-buffer-file-coding-system 'utf-8)
(setq org-export-coding-system 'utf-8)

(prefer-coding-system 'utf-8)
(set-charset-priority 'unicode)
(setq default-process-coding-system '(utf-8-unix . utf-8-unix))



;;Smooth keyboard scrolling
(setq
 redisplay-dont-pause t                 ;; scrolling
 scroll-step 1                          ;; scroll line per line (1 line instead of 3)
 scroll-margin 0                        ;; do smooth scrolling, ...
 scroll-conservatively 100000           ;; ... the defaults ...
 scroll-up-aggressively 0               ;; ... are very ...
 scroll-down-aggressively 0             ;; ... annoying
 auto-window-vscroll nil)

(require 'recentf)
(recentf-mode 1)
