.emacs.d/emacs.org
** Uniquify Buffer Names
Make buffer names unique.
#+begin_src emacs-lisp
  (require 'uniquify)

  ;; Use pathnames instead of <n> to uniquify buffer names
  ;;(setq uniquify-buffer-name-style 'post-forward-angle-brackets)

  (setq uniquify-buffer-name-style 'reverse)
  (setq uniquify-separator "|")
  (setq uniquify-after-kill-buffer-p t) ; rename after killing uniquified
  (setq uniquify-ignore-buffers-re "^\\*") ; don't muck with special buffers
#+end_src

