.emacs.d/emacs.html

<div id="outline-container-sec-8-7" class="outline-3">
<h3 id="sec-8-7"><span class="section-number-3">8.7</span> Uniquify Buffer Names</h3>
<div class="outline-text-3" id="text-8-7">
<p>
Make buffer names unique.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">require</span> '<span style="color: #BFEBBF;">uniquify</span><span style="color: #DCDCCC;">)</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Use pathnames instead of &lt;n&gt; to uniquify buffer names</span>
<span style="color: #5F7F5F;">;;</span><span style="color: #7F9F7F;">(setq uniquify-buffer-name-style 'post-forward-angle-brackets)</span>

<span style="color: #DCDCCC;">(</span>setq uniquify-buffer-name-style 'reverse<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>setq uniquify-separator <span style="color: #CC9393;">"|"</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>setq uniquify-after-kill-buffer-p t<span style="color: #DCDCCC;">)</span> <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">rename after killing uniquified</span>
<span style="color: #DCDCCC;">(</span>setq uniquify-ignore-buffers-re <span style="color: #CC9393;">"^\\*"</span><span style="color: #DCDCCC;">)</span> <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">don't muck with special buffers</span>
</pre>
</div>
</div>
</div>
