.emacs.d/emacs.org
** Fonts
- C-u C-x = :: Will describe the character under the cursor position, and show the font that it is rendered in.
- M-x list-faces-display :: Will display all faces that are currently defined.
     http://www.gnu.org/software/emacs/manual/html_node/emacs/Faces.html#Faces
- M-x describe-face :: e.g. M-x describe-face org-column-title, will allow customization of the title bar when in column mode.
     
#+begin_src emacs-lisp
    (defun ljc-set-font (fnt)
      (unless fnt
        (when macosx-p (setq fnt 'menlo))
        (when mswindows-p (setq fnt 'consolas)))
      
      (cond ((and (equal fnt 'anonymous)
                  (member "Anonymous Pro" (font-family-list)))
             ;; http://www.marksimonson.com/fonts/view/anonymous-pro
             (set-frame-font "Anonymous Pro 9"))
            ((and (equal fnt 'dejavu-mono)
                  (member "DejaVu Sans Mono" (font-family-list)))
             ;; Really nice font for text editing
             ;; http://dejavu-fonts.org/wiki/Main_Page
             (set-frame-font "DejaVu Sans Mono:antialias=natural") ; antialias=natural/none/standard/subpixel
             (set-face-attribute 'default nil :family "DejaVu Sans Mono" :weight 'normal :height 110))
            ((and (equal fnt 'inconsolata)
                  (member "Inconsolata" (font-family-list)))
             ;; http://levien.com/type/myfonts/inconsolata.html
             ;;(set-frame-font "Inconsolata:antialias=natural") ; antialias=natural/none/standard/subpixel
             ;;(set-face-attribute 'default nil :family "Menlo" :weight 'normal :height 120)
             (set-frame-font "Inconsolata 13"))
            ((and (equal fnt 'menlo)
                  (member "Menlo" (font-family-list)))
             ;; Default OSX font
             (set-frame-font "Menlo:antialias=natural") ; antialias=natural/none/standard/subpixel
             (set-face-attribute 'default nil :family "Menlo" :weight 'normal :height 110))
            ((and (equal fnt 'monospace)
                  (member "MonoSpace" (font-family-list)))
             ;; TODO
             (set-frame-font "Monospace 10"))
            ((and (equal fnt 'consolas)
                  (member "Consolas" (font-family-list)))
             ;; Default font on MSWindows
             (set-frame-font "Consolas 12"))
            ((and (equal fnt 'droid-sans)
                  (member "Droid Sans Mono" (font-family-list)))
             ;; http://damieng.com/blog/2007/11/14/droid-font-family-courtesy-of-google-ascender
             (set-frame-font "Droid Sans Mono 11"))
            ((and (equal fnt 'source-code)
                  (member "Source Code Pro" (font-family-list)))
             ;; http://sourceforge.net/projects/sourcecodepro.adobe/files/
             (set-frame-font "Source Code Pro 11"))
            ((and (equal fnt 'meslo)
                  (member "Meslo LG M DZ" (font-family-list)))
             ;; https://github.com/andreberg/Meslo-Font
             (set-frame-font "Meslo LG M DZ 10"))
            ((and (equal fnt 'profont)
                  (member "ProFontIIx" (font-family-list)))
             ;; http://tobiasjung.name/profont/
             (set-frame-font "ProFontIIx 9"))
            ((and (equal fnt 'monaco)
                  (member "Monaco" (font-family-list)))
             ;; Default on OSX
             (set-frame-font "Monaco 10"))
            ((and (equal fnt 'proggy)
                  (member "ProggyCleanTT" (font-family-list)))
             ;; http://www.proggyfonts.net
             (set-frame-font "ProggyCleanTT"))
            ))

    (ljc-set-font 'inconsolata)

#+end_src

