.emacs.d/emacs.html

<div id="outline-container-sec-8-8" class="outline-3">
<h3 id="sec-8-8"><span class="section-number-3">8.8</span> Fonts</h3>
<div class="outline-text-3" id="text-8-8">
<dl class="org-dl">
<dt> C-u C-x = </dt><dd>Will describe the character under the cursor position, and show the font that it is rendered in.
</dd>
<dt> M-x list-faces-display </dt><dd>Will display all faces that are currently defined.
<a href="http://www.gnu.org/software/emacs/manual/html_node/emacs/Faces.html#Faces">http://www.gnu.org/software/emacs/manual/html_node/emacs/Faces.html#Faces</a>
</dd>
<dt> M-x describe-face </dt><dd>e.g. M-x describe-face org-column-title, will allow customization of the title bar when in column mode.
</dd>
</dl>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">ljc-set-font</span> <span style="color: #BFEBBF;">(</span>fnt<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">unless</span> fnt
    <span style="color: #D0BF8F;">(</span><span style="color: #F0DFAF; font-weight: bold;">when</span> macosx-p <span style="color: #93E0E3;">(</span>setq fnt 'menlo<span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span><span style="color: #F0DFAF; font-weight: bold;">when</span> mswindows-p <span style="color: #93E0E3;">(</span>setq fnt 'consolas<span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span>

  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">cond</span> <span style="color: #D0BF8F;">(</span><span style="color: #93E0E3;">(</span>and <span style="color: #9FC59F;">(</span>equal fnt 'anonymous<span style="color: #9FC59F;">)</span>
              <span style="color: #9FC59F;">(</span>member <span style="color: #CC9393;">"Anonymous Pro"</span> <span style="color: #94BFF3;">(</span>font-family-list<span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span>
         <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">http://www.marksimonson.com/fonts/view/anonymous-pro</span>
         <span style="color: #93E0E3;">(</span>set-frame-font <span style="color: #CC9393;">"Anonymous Pro 9"</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
        <span style="color: #D0BF8F;">(</span><span style="color: #93E0E3;">(</span>and <span style="color: #9FC59F;">(</span>equal fnt 'dejavu-mono<span style="color: #9FC59F;">)</span>
              <span style="color: #9FC59F;">(</span>member <span style="color: #CC9393;">"DejaVu Sans Mono"</span> <span style="color: #94BFF3;">(</span>font-family-list<span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span>
         <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Really nice font for text editing</span>
         <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">http://dejavu-fonts.org/wiki/Main_Page</span>
         <span style="color: #93E0E3;">(</span>set-frame-font <span style="color: #CC9393;">"DejaVu Sans Mono:antialias=natural"</span><span style="color: #93E0E3;">)</span> <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">antialias=natural/none/standard/subpixel</span>
         <span style="color: #93E0E3;">(</span>set-face-attribute 'default nil <span style="color: #DCDCCC; font-weight: bold;">:family</span> <span style="color: #CC9393;">"DejaVu Sans Mono"</span> <span style="color: #DCDCCC; font-weight: bold;">:weight</span> 'normal <span style="color: #DCDCCC; font-weight: bold;">:height</span> 110<span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
        <span style="color: #D0BF8F;">(</span><span style="color: #93E0E3;">(</span>and <span style="color: #9FC59F;">(</span>equal fnt 'inconsolata<span style="color: #9FC59F;">)</span>
              <span style="color: #9FC59F;">(</span>member <span style="color: #CC9393;">"Inconsolata"</span> <span style="color: #94BFF3;">(</span>font-family-list<span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span>
         <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">http://levien.com/type/myfonts/inconsolata.html</span>
         <span style="color: #5F7F5F;">;;</span><span style="color: #7F9F7F;">(set-frame-font "Inconsolata:antialias=natural") ; antialias=natural/none/standard/subpixel</span>
         <span style="color: #5F7F5F;">;;</span><span style="color: #7F9F7F;">(set-face-attribute 'default nil :family "Menlo" :weight 'normal :height 120)</span>
         <span style="color: #93E0E3;">(</span>set-frame-font <span style="color: #CC9393;">"Inconsolata 13"</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
        <span style="color: #D0BF8F;">(</span><span style="color: #93E0E3;">(</span>and <span style="color: #9FC59F;">(</span>equal fnt 'menlo<span style="color: #9FC59F;">)</span>
              <span style="color: #9FC59F;">(</span>member <span style="color: #CC9393;">"Menlo"</span> <span style="color: #94BFF3;">(</span>font-family-list<span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span>
         <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Default OSX font</span>
         <span style="color: #93E0E3;">(</span>set-frame-font <span style="color: #CC9393;">"Menlo:antialias=natural"</span><span style="color: #93E0E3;">)</span> <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">antialias=natural/none/standard/subpixel</span>
         <span style="color: #93E0E3;">(</span>set-face-attribute 'default nil <span style="color: #DCDCCC; font-weight: bold;">:family</span> <span style="color: #CC9393;">"Menlo"</span> <span style="color: #DCDCCC; font-weight: bold;">:weight</span> 'normal <span style="color: #DCDCCC; font-weight: bold;">:height</span> 110<span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
        <span style="color: #D0BF8F;">(</span><span style="color: #93E0E3;">(</span>and <span style="color: #9FC59F;">(</span>equal fnt 'monospace<span style="color: #9FC59F;">)</span>
              <span style="color: #9FC59F;">(</span>member <span style="color: #CC9393;">"MonoSpace"</span> <span style="color: #94BFF3;">(</span>font-family-list<span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span>
         <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">TODO</span>
         <span style="color: #93E0E3;">(</span>set-frame-font <span style="color: #CC9393;">"Monospace 10"</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
        <span style="color: #D0BF8F;">(</span><span style="color: #93E0E3;">(</span>and <span style="color: #9FC59F;">(</span>equal fnt 'consolas<span style="color: #9FC59F;">)</span>
              <span style="color: #9FC59F;">(</span>member <span style="color: #CC9393;">"Consolas"</span> <span style="color: #94BFF3;">(</span>font-family-list<span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span>
         <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Default font on MSWindows</span>
         <span style="color: #93E0E3;">(</span>set-frame-font <span style="color: #CC9393;">"Consolas 12"</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
        <span style="color: #D0BF8F;">(</span><span style="color: #93E0E3;">(</span>and <span style="color: #9FC59F;">(</span>equal fnt 'droid-sans<span style="color: #9FC59F;">)</span>
              <span style="color: #9FC59F;">(</span>member <span style="color: #CC9393;">"Droid Sans Mono"</span> <span style="color: #94BFF3;">(</span>font-family-list<span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span>
         <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">http://damieng.com/blog/2007/11/14/droid-font-family-courtesy-of-google-ascender</span>
         <span style="color: #93E0E3;">(</span>set-frame-font <span style="color: #CC9393;">"Droid Sans Mono 11"</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
        <span style="color: #D0BF8F;">(</span><span style="color: #93E0E3;">(</span>and <span style="color: #9FC59F;">(</span>equal fnt 'source-code<span style="color: #9FC59F;">)</span>
              <span style="color: #9FC59F;">(</span>member <span style="color: #CC9393;">"Source Code Pro"</span> <span style="color: #94BFF3;">(</span>font-family-list<span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span>
         <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">http://sourceforge.net/projects/sourcecodepro.adobe/files/</span>
         <span style="color: #93E0E3;">(</span>set-frame-font <span style="color: #CC9393;">"Source Code Pro 11"</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
        <span style="color: #D0BF8F;">(</span><span style="color: #93E0E3;">(</span>and <span style="color: #9FC59F;">(</span>equal fnt 'meslo<span style="color: #9FC59F;">)</span>
              <span style="color: #9FC59F;">(</span>member <span style="color: #CC9393;">"Meslo LG M DZ"</span> <span style="color: #94BFF3;">(</span>font-family-list<span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span>
         <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">https://github.com/andreberg/Meslo-Font</span>
         <span style="color: #93E0E3;">(</span>set-frame-font <span style="color: #CC9393;">"Meslo LG M DZ 10"</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
        <span style="color: #D0BF8F;">(</span><span style="color: #93E0E3;">(</span>and <span style="color: #9FC59F;">(</span>equal fnt 'profont<span style="color: #9FC59F;">)</span>
              <span style="color: #9FC59F;">(</span>member <span style="color: #CC9393;">"ProFontIIx"</span> <span style="color: #94BFF3;">(</span>font-family-list<span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span>
         <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">http://tobiasjung.name/profont/</span>
         <span style="color: #93E0E3;">(</span>set-frame-font <span style="color: #CC9393;">"ProFontIIx 9"</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
        <span style="color: #D0BF8F;">(</span><span style="color: #93E0E3;">(</span>and <span style="color: #9FC59F;">(</span>equal fnt 'monaco<span style="color: #9FC59F;">)</span>
              <span style="color: #9FC59F;">(</span>member <span style="color: #CC9393;">"Monaco"</span> <span style="color: #94BFF3;">(</span>font-family-list<span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span>
         <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Default on OSX</span>
         <span style="color: #93E0E3;">(</span>set-frame-font <span style="color: #CC9393;">"Monaco 10"</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
        <span style="color: #D0BF8F;">(</span><span style="color: #93E0E3;">(</span>and <span style="color: #9FC59F;">(</span>equal fnt 'proggy<span style="color: #9FC59F;">)</span>
              <span style="color: #9FC59F;">(</span>member <span style="color: #CC9393;">"ProggyCleanTT"</span> <span style="color: #94BFF3;">(</span>font-family-list<span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span>
         <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">http://www.proggyfonts.net</span>
         <span style="color: #93E0E3;">(</span>set-frame-font <span style="color: #CC9393;">"ProggyCleanTT"</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
        <span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>

<span style="color: #DCDCCC;">(</span>ljc-set-font 'inconsolata<span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
