.emacs.d/emacs.html

<div id="outline-container-sec-8-9" class="outline-3">
<h3 id="sec-8-9"><span class="section-number-3">8.9</span> Use Spaces for Tabulation</h3>
<div class="outline-text-3" id="text-8-9">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Use space for tabulation</span>
<span style="color: #DCDCCC;">(</span>set-default 'indent-tabs-mode nil<span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-8-10" class="outline-3">
<h3 id="sec-8-10"><span class="section-number-3">8.10</span> Indicate Empty Lines</h3>
<div class="outline-text-3" id="text-8-10">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Indicate empty lines</span>
<span style="color: #DCDCCC;">(</span>set-default 'indicate-empty-lines t<span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-8-11" class="outline-3">
<h3 id="sec-8-11"><span class="section-number-3">8.11</span> Behaviour Within Buffers</h3>
<div class="outline-text-3" id="text-8-11">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span>setq next-line-add-newlines nil<span style="color: #DCDCCC;">)</span> <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Normally, C-n on the last line of a buffer appends a newline to it. </span>
                                  <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">If the variable next-line-add-newlines is nil, then C-n gets an error instead </span>
                                  <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">(like C-p on the first line).</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-8-12" class="outline-3">
<h3 id="sec-8-12"><span class="section-number-3">8.12</span> EOL Behaviour</h3>
<div class="outline-text-3" id="text-8-12">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #5F7F5F;">;;</span><span style="color: #7F9F7F;">(setq inhibit-eol-conversion t) ; This makes the windows EOL character ^M appear in the buffer</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-8-13" class="outline-3">
<h3 id="sec-8-13"><span class="section-number-3">8.13</span> Scrolling</h3>
<div class="outline-text-3" id="text-8-13">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span>setq scroll-step 1<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>setq scroll-conservatively 5<span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-8-14" class="outline-3">
<h3 id="sec-8-14"><span class="section-number-3">8.14</span> Misc customizations</h3>
<div class="outline-text-3" id="text-8-14">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Enable emacs functionality that is disabled by default</span>
<span style="color: #DCDCCC;">(</span>put 'set-goal-column 'disabled nil<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>put 'narrow-to-page 'disabled nil<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>put 'narrow-to-region 'disabled nil<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>put 'eval-expression 'disabled nil<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>put 'downcase-region 'disabled nil<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>put 'upcase-region 'disabled nil<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>setq enable-recursive-minibuffers t<span style="color: #DCDCCC;">)</span>


<span style="color: #DCDCCC;">(</span>setq inhibit-startup-message t<span style="color: #DCDCCC;">)</span>        <span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">no splash screen</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Iswitchb is much nicer for inter-buffer navigation.</span>
<span style="color: #DCDCCC;">(</span>iswitchb-mode 1<span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-8-15" class="outline-3">
<h3 id="sec-8-15"><span class="section-number-3">8.15</span> Searching &amp; Highlighting</h3>
<div class="outline-text-3" id="text-8-15">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">highlight matches from searches</span>
<span style="color: #DCDCCC;">(</span>setq isearch-highlight t<span style="color: #DCDCCC;">)</span> <span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">???</span>

<span style="color: #DCDCCC;">(</span>setq query-replace-highlight t<span style="color: #DCDCCC;">)</span> <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">highlight during searching ; Highlight query object</span>
<span style="color: #DCDCCC;">(</span>setq search-highlight t<span style="color: #DCDCCC;">)</span> <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">highlight incremental search ; Highlight search object</span>
<span style="color: #DCDCCC;">(</span>setq mouse-sel-retain-highlight t<span style="color: #DCDCCC;">)</span> <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">Keep mouse high-lightening</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-8-16" class="outline-3">
<h3 id="sec-8-16"><span class="section-number-3">8.16</span> Backups</h3>
<div class="outline-text-3" id="text-8-16">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span>setq backup-inhibited t<span style="color: #DCDCCC;">)</span> <span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">disable backup  </span>
<span style="color: #DCDCCC;">(</span>setq make-backup-files nil<span style="color: #DCDCCC;">)</span> <span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">do not make backup files</span>
<span style="color: #DCDCCC;">(</span>setq use-backup-dir t<span style="color: #DCDCCC;">)</span>  <span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">use backup directory</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-8-17" class="outline-3">
<h3 id="sec-8-17"><span class="section-number-3">8.17</span> Auto-save</h3>
<div class="outline-text-3" id="text-8-17">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span>setq auto-save-default nil<span style="color: #DCDCCC;">)</span>            <span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">disable auto save</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-8-18" class="outline-3">
<h3 id="sec-8-18"><span class="section-number-3">8.18</span> Text Mark, Select, Copy, Paste &amp; Cut</h3>
<div class="outline-text-3" id="text-8-18">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span>cua-mode t<span style="color: #DCDCCC;">)</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">MS Windows Conventional mouse/arrow movement &amp; selection</span>
<span style="color: #5F7F5F;">;;</span><span style="color: #7F9F7F;">(delete-selection-mode t) ; Set in cua-mode</span>
<span style="color: #5F7F5F;">;;</span><span style="color: #7F9F7F;">(transient-mark-mode t) ; org-mode</span>

<span style="color: #DCDCCC;">(</span>cua-selection-mode t<span style="color: #DCDCCC;">)</span>    <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">nil == C-c=Copy, C-x=Cut, C-v=Paste</span>
                          <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">t == Use the standard Emacs keys for copy/paste etc.</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">This is set by CUA-mode.  Defining this anyway in case CUA editing keys are disabled.</span>
<span style="color: #DCDCCC;">(</span>define-key global-map <span style="color: #BFEBBF;">[</span>?\C-z<span style="color: #BFEBBF;">]</span> 'undo<span style="color: #DCDCCC;">)</span> <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Map C-z back to undo</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">(setq cua-highlight-region-shift-only nil) ;; Set transient mark mode. i.e C-SPACE</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">(setq cua-toggle-set-mark t)</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Make the Emacs kill ring work nice with the system clipboard.</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Otherwise copy/paste between Emacs and the system will not work.</span>
<span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">unless</span> mswindows-p
  <span style="color: #BFEBBF;">(</span>setq x-select-enable-clipboard t<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
