.emacs.d/emacs.el

;; Use space for tabulation
(set-default 'indent-tabs-mode nil)

;; Indicate empty lines
(set-default 'indicate-empty-lines t)

(setq next-line-add-newlines nil) ;; Normally, C-n on the last line of a buffer appends a newline to it. 
                                  ;; If the variable next-line-add-newlines is nil, then C-n gets an error instead 
                                  ;; (like C-p on the first line).

;;(setq inhibit-eol-conversion t) ; This makes the windows EOL character ^M appear in the buffer

(setq scroll-step 1)
(setq scroll-conservatively 5)

;; Enable emacs functionality that is disabled by default
(put 'set-goal-column 'disabled nil)
(put 'narrow-to-page 'disabled nil)
(put 'narrow-to-region 'disabled nil)
(put 'eval-expression 'disabled nil)
(put 'downcase-region 'disabled nil)
(put 'upcase-region 'disabled nil)
(setq enable-recursive-minibuffers t)

;; Iswitchb is much nicer for inter-buffer navigation.
(iswitchb-mode 1)

;; highlight matches from searches
(setq isearch-highlight t) ;???

(setq query-replace-highlight t) ; highlight during searching ; Highlight query object
(setq search-highlight t) ; highlight incremental search ; Highlight search object
(setq mouse-sel-retain-highlight t) ; Keep mouse high-lightening

(setq backup-inhibited t) ;disable backup  
(setq make-backup-files nil) ;do not make backup files
(setq use-backup-dir t)  ;use backup directory

(setq auto-save-default nil)            ;disable auto save

(cua-mode t)

;; MS Windows Conventional mouse/arrow movement & selection
;;(delete-selection-mode t) ; Set in cua-mode
;;(transient-mark-mode t) ; org-mode
  
(cua-selection-mode t)    ;; nil == C-c=Copy, C-x=Cut, C-v=Paste
                          ;; t == Use the standard Emacs keys for copy/paste etc.

;; This is set by CUA-mode.  Defining this anyway in case CUA editing keys are disabled.
(define-key global-map [?\C-z] 'undo) ;; Map C-z back to undo

;; (setq cua-highlight-region-shift-only nil) ;; Set transient mark mode. i.e C-SPACE
;; (setq cua-toggle-set-mark t)
  
;; Make the Emacs kill ring work nice with the system clipboard.
;; Otherwise copy/paste between Emacs and the system will not work.
(unless mswindows-p
  (setq x-select-enable-clipboard t))
