.emacs.d/emacs.html

<div id="outline-container-sec-8-19" class="outline-3">
<h3 id="sec-8-19"><span class="section-number-3">8.19</span> Cursor Colors</h3>
<div class="outline-text-3" id="text-8-19">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">This requires (cua-mode t), set previously.</span>
<span style="color: #DCDCCC;">(</span>setq cua-enable-cursor-indications t<span style="color: #DCDCCC;">)</span>  <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">Enable the cursor indications</span>
<span style="color: #DCDCCC;">(</span>setq cua-normal-cursor-color <span style="color: #CC9393;">"orange"</span><span style="color: #DCDCCC;">)</span> <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">The following will use a ORANGE cursor </span>
                                        <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">in normal (insertion) mode in read-write buffers, </span>
<span style="color: #DCDCCC;">(</span>setq cua-overwrite-cursor-color <span style="color: #CC9393;">"red"</span><span style="color: #DCDCCC;">)</span> <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">a RED cursor in overwrite mode in read-write buffers, </span>
<span style="color: #DCDCCC;">(</span>setq cua-read-only-cursor-color <span style="color: #CC9393;">"green"</span><span style="color: #DCDCCC;">)</span> <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">and a GREEN cursor read-only buffers</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-8-20" class="outline-3">
<h3 id="sec-8-20"><span class="section-number-3">8.20</span> Font Lock</h3>
<div class="outline-text-3" id="text-8-20">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">(require 'font-lock)</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Necessary for very large files</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">See "http://www.sunsite.ualberta.ca/Documentation/Gnu/emacs-20.7/html_chapter/emacs_18.html"</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">for a description of when to use font-lock versus jit-lock modes.</span>
<span style="color: #DCDCCC;">(</span>global-font-lock-mode t<span style="color: #DCDCCC;">)</span> <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">colorize all buffers</span>
<span style="color: #DCDCCC;">(</span>setq jit-lock-stealth-time 16
      jit-lock-defer-contextually t
      jit-lock-stealth-nice 0.5<span style="color: #DCDCCC;">)</span>
<span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">(setq font-lock-multiline t)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-8-21" class="outline-3">
<h3 id="sec-8-21"><span class="section-number-3">8.21</span> Dired Customization</h3>
<div class="outline-text-3" id="text-8-21">
<p>
File and directory management.
<a href="http://www.gnu.org/software/emacs/manual/html_node/emacs/Dired.html">http://www.gnu.org/software/emacs/manual/html_node/emacs/Dired.html</a>
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">require</span> '<span style="color: #BFEBBF;">dired</span><span style="color: #DCDCCC;">)</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Using 'a' to open a directory in the same buffer</span>
<span style="color: #DCDCCC;">(</span>put 'dired-find-alternative-file 'disabled nil<span style="color: #DCDCCC;">)</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Activate hl-line minor mode</span>
<span style="color: #DCDCCC;">(</span>add-hook 'dired-mode-hook
          <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">lambda</span> <span style="color: #D0BF8F;">()</span>
            <span style="color: #D0BF8F;">(</span>hl-line-mode t<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Refresh also dired buffer</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">From Magnars blog</span>
<span style="color: #DCDCCC;">(</span>setq global-auto-revert-non-file-buffers t<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>setq auto-revert-verbose nil<span style="color: #DCDCCC;">)</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Other</span>
<span style="color: #DCDCCC;">(</span>setq dired-listing-switches <span style="color: #CC9393;">"-l"</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">when</span> macosx-p <span style="color: #BFEBBF;">(</span>setq dired-use-ls-dired nil<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-8-22" class="outline-3">
<h3 id="sec-8-22"><span class="section-number-3">8.22</span> Modeline etc.</h3>
<div class="outline-text-3" id="text-8-22">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Set the name of the host and current path/file in title bar:</span>
<span style="color: #DCDCCC;">(</span>setq frame-title-format
      <span style="color: #BFEBBF;">(</span>list <span style="color: #D0BF8F;">(</span>format <span style="color: #CC9393;">"%s %%S: %%j "</span> <span style="color: #93E0E3;">(</span>system-name<span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
            '<span style="color: #D0BF8F;">(</span>buffer-file-name <span style="color: #CC9393;">"%f"</span> <span style="color: #93E0E3;">(</span>dired-directory dired-directory <span style="color: #CC9393;">"%b"</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Column &amp; line numbers in mode bar</span>
<span style="color: #DCDCCC;">(</span>column-number-mode t<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>line-number-mode t<span style="color: #DCDCCC;">)</span>

<span style="color: #DCDCCC;">(</span>setq indicate-buffer-boundaries 'left<span style="color: #DCDCCC;">)</span>

<span style="color: #DCDCCC;">(</span>size-indication-mode 1<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>setq display-time-24hr-format t<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>display-time-mode 1<span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-8-23" class="outline-3">
<h3 id="sec-8-23"><span class="section-number-3">8.23</span> Image Support</h3>
<div class="outline-text-3" id="text-8-23">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Add PNG support to emacs</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">http://www.libpng.org/pub/png/libpng.html</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">http://openil.sourceforge.net/</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">http://stackoverflow.com/questions/2650041/emacs-under-windows-and-png-files</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-8-24" class="outline-3">
<h3 id="sec-8-24"><span class="section-number-3">8.24</span> Mouse Events</h3>
<div class="outline-text-3" id="text-8-24">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Disable mouse-2 event that was appending text into documents</span>
<span style="color: #DCDCCC;">(</span>global-set-key <span style="color: #BFEBBF;">[</span>mouse-2<span style="color: #BFEBBF;">]</span> nil<span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
