.emacs.d/emacs.el

;; This requires (cua-mode t), set previously.
(setq cua-enable-cursor-indications t)  ; Enable the cursor indications
(setq cua-normal-cursor-color "orange") ; The following will use a ORANGE cursor 
                                        ; in normal (insertion) mode in read-write buffers, 
(setq cua-overwrite-cursor-color "red") ; a RED cursor in overwrite mode in read-write buffers, 
(setq cua-read-only-cursor-color "green") ; and a GREEN cursor read-only buffers

;; (require 'font-lock)

;; Necessary for very large files
;; See "http://www.sunsite.ualberta.ca/Documentation/Gnu/emacs-20.7/html_chapter/emacs_18.html"
;; for a description of when to use font-lock versus jit-lock modes.
(global-font-lock-mode t) ;; colorize all buffers
(setq jit-lock-stealth-time 16
      jit-lock-defer-contextually t
      jit-lock-stealth-nice 0.5)
;(setq font-lock-multiline t)

(require 'dired)

;; Using 'a' to open a directory in the same buffer
(put 'dired-find-alternative-file 'disabled nil)

;; Activate hl-line minor mode
(add-hook 'dired-mode-hook
          (lambda ()
            (hl-line-mode t)))

;; Refresh also dired buffer
;; From Magnars blog
(setq global-auto-revert-non-file-buffers t)
(setq auto-revert-verbose nil)

;; Other
(setq dired-listing-switches "-l")
(when macosx-p (setq dired-use-ls-dired nil))

;; Set the name of the host and current path/file in title bar:
(setq frame-title-format
      (list (format "%s %%S: %%j " (system-name))
            '(buffer-file-name "%f" (dired-directory dired-directory "%b"))))

;; Column & line numbers in mode bar
(column-number-mode t)
(line-number-mode t)

(setq indicate-buffer-boundaries 'left)

(size-indication-mode 1)
(setq display-time-24hr-format t)
(display-time-mode 1)

;; Add PNG support to emacs
;; http://www.libpng.org/pub/png/libpng.html
;; http://openil.sourceforge.net/
;; http://stackoverflow.com/questions/2650041/emacs-under-windows-and-png-files

;; Disable mouse-2 event that was appending text into documents
(global-set-key [mouse-2] nil)
