.emacs.d/emacs.org
** Shells
#+begin_src emacs-lisp
  ;; Shells are assigned to f11
  ;; F11 - eshell
  ;; (global-set-key [f11] '(lambda ()
  ;;                     (interactive)
  ;;                     (eshell)))
    
  ;; ;; ctrl-F11 cmdproxy
  ;; (global-set-key [(control f11)]
  ;;                 '(lambda ()
  ;;                   (interactive)
  ;;                   (cond
  ;;                     (mswindows-p
  ;;                      (let ((explicit-shell-file-name
  ;;                             (expand-file-name "bin/cmdproxy.exe" (getenv "EMACS_DIR")))
  ;;                            (shell-file-name "cmdproxy.exe"))
  ;;                        (shell)))
  ;;                     (t (shell)))))
  ;; ;; Alt-F11 bash
  ;; (global-set-key [(meta f11)]
  ;;                 '(lambda ()
  ;;                   (interactive)
  ;;                   (let ((explicit-shell-file-name
  ;;                          (if mswindows-p
  ;;                              "bash.exe"
  ;;                              "bash"))
  ;;                         (shell-file-name
  ;;                          (if mswindows-p
  ;;                              "bash.exe"
  ;;                              "bash")))
  ;;                     (shell))))
#+end_src

** Window Management
#+ATTR_LaTeX: :align |l|p{10cm}|
| Key Chord | Description                                                                                                              |
|           | <120>                                                                                                                    |
|-----------+--------------------------------------------------------------------------------------------------------------------------|
| C-x 2     | split-window-vertically -- splits your current window into two equal-height windows showing the same buffer (until you change one of them to show something else.) |
| C-x 3     | split-window-horizontally -- most people don't use this as often, but it's occasionally useful. Splits the window into a left-side and a right-side. |
| C-x +     | balance-windows -- makes all visible windows approximately equal height. This is useful if you've just done Ctrl-x 2 twice in a row, because you'll have two 1/4-height windows and one 1/2-height window. Ctrl-x + makes them all the same height. |
| C-x 1     | delete-other-windows -- makes the currently focused window fill the entire frame; the others go away. Note that the buffers they were visiting stay around in the buffer-list, so it's always perfectly safe to execute this command. |
| C-x C-b   | list-buffers -- shows a list of all the buffers you have open, in a nicely formatted buffer called "*Buffer List*". This buffer's mode has many convenience keys for manipulating the buffer list. For instance, typing "d" while the cursor is on one of the entries will flag that buffer for deletion, "x" will kill the buffer, and so on. Use M-x describe-bindings to view all the Buffer-menu key bindings. |
| C-x o     | other-window -- jumps to another window                                                                                  |
| C-x p     | jumps to the previous window                                                                                             |

#+begin_src emacs-lisp
  ;; Opposite of C-x o
  ;; (other-window -1)  
  (global-set-key [(control x) (p)] '(lambda () 
                                      (interactive)
                                      (other-window -1)))
#+end_src

** Define Keys
*** Global Keys
#+BEGIN_SRC emacs-lisp
(global-set-key (quote [f3]) 'bzg-big-fringe-mode)

#+END_SRC

