.emacs.d/emacs.html

<div id="outline-container-sec-8-25" class="outline-3">
<h3 id="sec-8-25"><span class="section-number-3">8.25</span> Shells</h3>
<div class="outline-text-3" id="text-8-25">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Shells are assigned to f11</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">F11 - eshell</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">(global-set-key [f11] '(lambda ()</span>
<span style="color: #5F7F5F;">;;                     </span><span style="color: #7F9F7F;">(interactive)</span>
<span style="color: #5F7F5F;">;;                     </span><span style="color: #7F9F7F;">(eshell)))</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">;; ctrl-F11 cmdproxy</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">(global-set-key [(control f11)]</span>
<span style="color: #5F7F5F;">;;                 </span><span style="color: #7F9F7F;">'(lambda ()</span>
<span style="color: #5F7F5F;">;;                   </span><span style="color: #7F9F7F;">(interactive)</span>
<span style="color: #5F7F5F;">;;                   </span><span style="color: #7F9F7F;">(cond</span>
<span style="color: #5F7F5F;">;;                     </span><span style="color: #7F9F7F;">(mswindows-p</span>
<span style="color: #5F7F5F;">;;                      </span><span style="color: #7F9F7F;">(let ((explicit-shell-file-name</span>
<span style="color: #5F7F5F;">;;                             </span><span style="color: #7F9F7F;">(expand-file-name "bin/cmdproxy.exe" (getenv "EMACS_DIR")))</span>
<span style="color: #5F7F5F;">;;                            </span><span style="color: #7F9F7F;">(shell-file-name "cmdproxy.exe"))</span>
<span style="color: #5F7F5F;">;;                        </span><span style="color: #7F9F7F;">(shell)))</span>
<span style="color: #5F7F5F;">;;                     </span><span style="color: #7F9F7F;">(t (shell)))))</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">;; Alt-F11 bash</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">(global-set-key [(meta f11)]</span>
<span style="color: #5F7F5F;">;;                 </span><span style="color: #7F9F7F;">'(lambda ()</span>
<span style="color: #5F7F5F;">;;                   </span><span style="color: #7F9F7F;">(interactive)</span>
<span style="color: #5F7F5F;">;;                   </span><span style="color: #7F9F7F;">(let ((explicit-shell-file-name</span>
<span style="color: #5F7F5F;">;;                          </span><span style="color: #7F9F7F;">(if mswindows-p</span>
<span style="color: #5F7F5F;">;;                              </span><span style="color: #7F9F7F;">"bash.exe"</span>
<span style="color: #5F7F5F;">;;                              </span><span style="color: #7F9F7F;">"bash"))</span>
<span style="color: #5F7F5F;">;;                         </span><span style="color: #7F9F7F;">(shell-file-name</span>
<span style="color: #5F7F5F;">;;                          </span><span style="color: #7F9F7F;">(if mswindows-p</span>
<span style="color: #5F7F5F;">;;                              </span><span style="color: #7F9F7F;">"bash.exe"</span>
<span style="color: #5F7F5F;">;;                              </span><span style="color: #7F9F7F;">"bash")))</span>
<span style="color: #5F7F5F;">;;                     </span><span style="color: #7F9F7F;">(shell))))</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-8-26" class="outline-3">
<h3 id="sec-8-26"><span class="section-number-3">8.26</span> Window Management</h3>
<div class="outline-text-3" id="text-8-26">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Key Chord</th>
<th scope="col" class="left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">C-x 2</td>
<td class="left">split-window-vertically &#x2013; splits your current window into two equal-height windows showing the same buffer (until you change one of them to show something else.)</td>
</tr>

<tr>
<td class="left">C-x 3</td>
<td class="left">split-window-horizontally &#x2013; most people don't use this as often, but it's occasionally useful. Splits the window into a left-side and a right-side.</td>
</tr>

<tr>
<td class="left">C-x +</td>
<td class="left">balance-windows &#x2013; makes all visible windows approximately equal height. This is useful if you've just done Ctrl-x 2 twice in a row, because you'll have two 1/4-height windows and one 1/2-height window. Ctrl-x + makes them all the same height.</td>
</tr>

<tr>
<td class="left">C-x 1</td>
<td class="left">delete-other-windows &#x2013; makes the currently focused window fill the entire frame; the others go away. Note that the buffers they were visiting stay around in the buffer-list, so it's always perfectly safe to execute this command.</td>
</tr>

<tr>
<td class="left">C-x C-b</td>
<td class="left">list-buffers &#x2013; shows a list of all the buffers you have open, in a nicely formatted buffer called "<b>Buffer List</b>". This buffer's mode has many convenience keys for manipulating the buffer list. For instance, typing "d" while the cursor is on one of the entries will flag that buffer for deletion, "x" will kill the buffer, and so on. Use M-x describe-bindings to view all the Buffer-menu key bindings.</td>
</tr>

<tr>
<td class="left">C-x o</td>
<td class="left">other-window &#x2013; jumps to another window</td>
</tr>

<tr>
<td class="left">C-x p</td>
<td class="left">jumps to the previous window</td>
</tr>
</tbody>
</table>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Opposite of C-x o</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">(other-window -1)  </span>
<span style="color: #DCDCCC;">(</span>global-set-key <span style="color: #BFEBBF;">[</span><span style="color: #D0BF8F;">(</span>control x<span style="color: #D0BF8F;">)</span> <span style="color: #D0BF8F;">(</span>p<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">]</span> '<span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">lambda</span> <span style="color: #D0BF8F;">()</span> 
                                    <span style="color: #D0BF8F;">(</span>interactive<span style="color: #D0BF8F;">)</span>
                                    <span style="color: #D0BF8F;">(</span>other-window -1<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
