.emacs.d/emacs.el

;; Shells are assigned to f11
;; F11 - eshell
;; (global-set-key [f11] '(lambda ()
;;                     (interactive)
;;                     (eshell)))
  
;; ;; ctrl-F11 cmdproxy
;; (global-set-key [(control f11)]
;;                 '(lambda ()
;;                   (interactive)
;;                   (cond
;;                     (mswindows-p
;;                      (let ((explicit-shell-file-name
;;                             (expand-file-name "bin/cmdproxy.exe" (getenv "EMACS_DIR")))
;;                            (shell-file-name "cmdproxy.exe"))
;;                        (shell)))
;;                     (t (shell)))))
;; ;; Alt-F11 bash
;; (global-set-key [(meta f11)]
;;                 '(lambda ()
;;                   (interactive)
;;                   (let ((explicit-shell-file-name
;;                          (if mswindows-p
;;                              "bash.exe"
;;                              "bash"))
;;                         (shell-file-name
;;                          (if mswindows-p
;;                              "bash.exe"
;;                              "bash")))
;;                     (shell))))

;; Opposite of C-x o
;; (other-window -1)  
(global-set-key [(control x) (p)] '(lambda () 
                                    (interactive)
                                    (other-window -1)))

(global-set-key (quote [f3]) 'bzg-big-fringe-mode)
