.emacs.d/emacs.org
*** Key Overrides
#+begin_src emacs-lisp
  ;; Prevent accidentally killing emacs.
  (global-set-key [(control x) (control c)] 
                  '(lambda ()
                     (interactive)
                     (if (y-or-n-p-with-timeout "Do you really want to exit Emacs ? " 4 nil)
                         (save-buffers-kill-emacs))))
  
  ;; Get rid of set-fill-column, and instead open a list of recent files
  (global-set-key [(control x) (f)] 'recentf-open-files)
        
  ;; Shortcuts to common functions
  (global-set-key [(control c) (f)] 'find-function-at-point)
  (global-set-key [(control c) (g)] 'goto-line)
  (global-set-key [(control c) (control g)] 'goto-line)
    
  ;; keys for buffer creation and navigation.  
  ;;  Use C-x C-b instead of the usual C-x b
  (global-set-key [(control x) (control b)] 'iswitchb-buffer)
    
  ;; Set C-c h to help
  (global-set-key [(control c) (h)] 'help-command)
  
  ;; For whatever reason, the HELLO file locks up this version of Emacs for Windows.
  ;; Unset this command.
  (global-unset-key [(control c) (h) (h)])
     
  ;; http://sites.google.com/site/steveyegge2/effective-emacs
  ;; Item 2: Invoke M-x without the Alt key
  (global-set-key [(control x) (control m)] 'execute-extended-command)
    
  ;;Item 3: Prefer backward-kill-word over Backspace
  (global-set-key [(control w)] 'backward-kill-word)
  (global-set-key [(control x) (control k)] 'kill-region) ;; Instead of C-w 
  ;;(global-set-key "\C-c\C-k" 'kill-region) ; org-mode has this mapped      
  
  ;; Map pcomplete to C-<tab>, otherwise clobbered by flyspell mode
  ;(global-set-key [(control c) (tab)] 'pcomplete)
#+end_src

*** OSX Key Overrides
M-x customize-group RET ns RET

See http://emacsformacosx.com/tips

#+begin_src emacs-lisp
;; (setq ns-right-command-modifier 'meta)
#+end_src

** OSX Customization
#+BEGIN_SRC emacs-lisp
  (when (boundp mac-allow-anti-aliasing)
    (setf mac-allow-anti-aliasing t))
#+END_SRC
** Emacs Client                                                   :noexport:
Eventually, add support for Emacs Client here; http://www.emacswiki.org/emacs/EmacsClient
#+begin_src emacs-lisp
  ;; Note that the cua-emul, gnuserve & cua libraries are optional
  ;; (if mswindows-p
  ;;     (progn
  ;;       ;; Grep equivalent on Windows
  ;;       ;;(setq grep-command "c:/cygwin/bin/grep -n -a -e ")
  ;;       (setq grep-command "findstr /n /s ")

  ;;       ;; Windows Execute from dired
  ;;       (define-key dired-mode-map "w"
  ;;         (function
  ;;          (lambda ()
  ;;            (interactive)
  ;;            (setq w32-shellex-no-dired-hook t)
  ;;            (require 'w32-shellex)
  ;;            (w32-shellex-dired-on-objects))))

  ;;       ;; Start gnuserv on Windows 
  ;;       (if (or (eq window-system 'w32) (eq window-system 'win32))
  ;;           (when (require 'gnuserv nil 'noerror)
  ;;             (setq server-done-function 'bury-buffer 
  ;;                   gnuserv-frame (car (frame-list))) 
  ;;             (gnuserv-start) 
  ;;             ;; Open buffer in existing frame instead of creating new one... 
  ;;             (setq gnuserv-frame (selected-frame)) 
  ;;             (message "gnuserv started.")))))
#+end_src

** Working with Asynchronous External Processes                   :noexport:
#+begin_src emacs-lisp
  ;; (require 'comint)
#+end_src

