.emacs.d/emacs.html

<div id="outline-container-sec-8-27" class="outline-3">
<h3 id="sec-8-27"><span class="section-number-3">8.27</span> Define Keys</h3>
<div class="outline-text-3" id="text-8-27">
</div><div id="outline-container-sec-8-27-1" class="outline-4">
<h4 id="sec-8-27-1"><span class="section-number-4">8.27.1</span> Global Keys</h4>
<div class="outline-text-4" id="text-8-27-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span>global-set-key <span style="color: #BFEBBF;">(</span>quote <span style="color: #D0BF8F;">[</span>f3<span style="color: #D0BF8F;">]</span><span style="color: #BFEBBF;">)</span> 'bzg-big-fringe-mode<span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-8-27-2" class="outline-4">
<h4 id="sec-8-27-2"><span class="section-number-4">8.27.2</span> Key Overrides</h4>
<div class="outline-text-4" id="text-8-27-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Prevent accidentally killing emacs.</span>
<span style="color: #DCDCCC;">(</span>global-set-key <span style="color: #BFEBBF;">[</span><span style="color: #D0BF8F;">(</span>control x<span style="color: #D0BF8F;">)</span> <span style="color: #D0BF8F;">(</span>control c<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">]</span> 
                '<span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">lambda</span> <span style="color: #D0BF8F;">()</span>
                   <span style="color: #D0BF8F;">(</span>interactive<span style="color: #D0BF8F;">)</span>
                   <span style="color: #D0BF8F;">(</span><span style="color: #F0DFAF; font-weight: bold;">if</span> <span style="color: #93E0E3;">(</span>y-or-n-p-with-timeout <span style="color: #CC9393;">"Do you really want to exit Emacs ? "</span> 4 nil<span style="color: #93E0E3;">)</span>
                       <span style="color: #93E0E3;">(</span>save-buffers-kill-emacs<span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Get rid of set-fill-column, and instead open a list of recent files</span>
<span style="color: #DCDCCC;">(</span>global-set-key <span style="color: #BFEBBF;">[</span><span style="color: #D0BF8F;">(</span>control x<span style="color: #D0BF8F;">)</span> <span style="color: #D0BF8F;">(</span>f<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">]</span> 'recentf-open-files<span style="color: #DCDCCC;">)</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Shortcuts to common functions</span>
<span style="color: #DCDCCC;">(</span>global-set-key <span style="color: #BFEBBF;">[</span><span style="color: #D0BF8F;">(</span>control c<span style="color: #D0BF8F;">)</span> <span style="color: #D0BF8F;">(</span>f<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">]</span> 'find-function-at-point<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>global-set-key <span style="color: #BFEBBF;">[</span><span style="color: #D0BF8F;">(</span>control c<span style="color: #D0BF8F;">)</span> <span style="color: #D0BF8F;">(</span>g<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">]</span> 'goto-line<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>global-set-key <span style="color: #BFEBBF;">[</span><span style="color: #D0BF8F;">(</span>control c<span style="color: #D0BF8F;">)</span> <span style="color: #D0BF8F;">(</span>control g<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">]</span> 'goto-line<span style="color: #DCDCCC;">)</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">keys for buffer creation and navigation.  </span>
<span style="color: #5F7F5F;">;;  </span><span style="color: #7F9F7F;">Use C-x C-b instead of the usual C-x b</span>
<span style="color: #DCDCCC;">(</span>global-set-key <span style="color: #BFEBBF;">[</span><span style="color: #D0BF8F;">(</span>control x<span style="color: #D0BF8F;">)</span> <span style="color: #D0BF8F;">(</span>control b<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">]</span> 'iswitchb-buffer<span style="color: #DCDCCC;">)</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Set C-c h to help</span>
<span style="color: #DCDCCC;">(</span>global-set-key <span style="color: #BFEBBF;">[</span><span style="color: #D0BF8F;">(</span>control c<span style="color: #D0BF8F;">)</span> <span style="color: #D0BF8F;">(</span>h<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">]</span> 'help-command<span style="color: #DCDCCC;">)</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">For whatever reason, the HELLO file locks up this version of Emacs for Windows.</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Unset this command.</span>
<span style="color: #DCDCCC;">(</span>global-unset-key <span style="color: #BFEBBF;">[</span><span style="color: #D0BF8F;">(</span>control c<span style="color: #D0BF8F;">)</span> <span style="color: #D0BF8F;">(</span>h<span style="color: #D0BF8F;">)</span> <span style="color: #D0BF8F;">(</span>h<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">]</span><span style="color: #DCDCCC;">)</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">http://sites.google.com/site/steveyegge2/effective-emacs</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Item 2: Invoke M-x without the Alt key</span>
<span style="color: #DCDCCC;">(</span>global-set-key <span style="color: #BFEBBF;">[</span><span style="color: #D0BF8F;">(</span>control x<span style="color: #D0BF8F;">)</span> <span style="color: #D0BF8F;">(</span>control m<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">]</span> 'execute-extended-command<span style="color: #DCDCCC;">)</span>

<span style="color: #5F7F5F;">;;</span><span style="color: #7F9F7F;">Item 3: Prefer backward-kill-word over Backspace</span>
<span style="color: #DCDCCC;">(</span>global-set-key <span style="color: #BFEBBF;">[</span><span style="color: #D0BF8F;">(</span>control w<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">]</span> 'backward-kill-word<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>global-set-key <span style="color: #BFEBBF;">[</span><span style="color: #D0BF8F;">(</span>control x<span style="color: #D0BF8F;">)</span> <span style="color: #D0BF8F;">(</span>control k<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">]</span> 'kill-region<span style="color: #DCDCCC;">)</span> <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Instead of C-w </span>
<span style="color: #5F7F5F;">;;</span><span style="color: #7F9F7F;">(global-set-key "\C-c\C-k" 'kill-region) ; org-mode has this mapped      </span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Map pcomplete to C-&lt;tab&gt;, otherwise clobbered by flyspell mode</span>
<span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">(global-set-key [(control c) (tab)] 'pcomplete)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-8-28" class="outline-3">
<h3 id="sec-8-28"><span class="section-number-3">8.28</span> OSX Key Overrides</h3>
<div class="outline-text-3" id="text-8-28">
<p>
M-x customize-group RET ns RET
</p>

<p>
See <a href="http://emacsformacosx.com/tips">http://emacsformacosx.com/tips</a>
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">(setq ns-right-command-modifier 'meta)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-8-29" class="outline-3">
<h3 id="sec-8-29"><span class="section-number-3">8.29</span> OSX Customization</h3>
<div class="outline-text-3" id="text-8-29">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">when</span> <span style="color: #BFEBBF;">(</span>boundp mac-allow-anti-aliasing<span style="color: #BFEBBF;">)</span> 
  <span style="color: #BFEBBF;">(</span>setf mac-allow-anti-aliasing t<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
