.emacs.d/emacs.org
** Auto Completion
There are two main auto-completes for Emacs; Auto-complete, and Company-mode.

From https://github.com/auto-complete/auto-complete
#+BEGIN_SRC emacs-lisp
  (if t
      (progn
        (require 'company)
        (add-hook 'emacs-lisp-mode-hook 'company-mode)
        (add-hook 'emacs-lisp-mode-hook 'company-mode 'append))
    (progn
      ;; (require 'auto-complete)
      ;; (require 'auto-complete-config)
      ;; (ac-config-default)
      ))
#+END_SRC

** Undo/Redo with Undo-Tree                                       :noexport:
http://www.emacswiki.org/emacs/UndoTree
http://ergoemacs.org/emacs/emacs_best_redo_mode.html
#+BEGIN_SRC emacs-lisp
  ;(require 'undo-tree)
  
  ;(global-undo-tree-mode)
  
  ;(defalias 'redo 'undo-tree-redo)
  ;(global-set-key [(control z)] 'undo) ; [Ctrl+z]
  ;(global-set-key [(control shift z)] 'redo) ; [Ctrl+Shift+z];  Mac style  
  ;(global-set-key [(control y)] 'redo) ; [Ctrl+y]; Microsoft Windows style
#+END_SRC

** Smart Home
Currently not enabled as Org-Mode does a better job.
http://stackoverflow.com/questions/145291/smart-home-in-emacs
#+BEGIN_SRC emacs-lisp
  (defun smart-beginning-of-line ()
    "Move point to first non-whitespace character or beginning-of-line.
  
  Move point to the first non-whitespace character on this line.
  If point was already at that position, move point to beginning of line."
    (interactive) ; Use (interactive "^") in Emacs 23 to make shift-select work
    (let ((oldpos (point)))
      (back-to-indentation)
      (and (= oldpos (point))
           (beginning-of-line))))
  
  ;;(global-set-key [home] 'smart-beginning-of-line)
#+END_SRC

** Common Lisp Editing
*** Associate ASDF File Extensions to Major Modes
#+begin_src emacs-lisp
(add-to-list 'auto-mode-alist '("\\.asd$" . lisp-mode)) ;; Allow ASDF files to be edited as lisp files
#+end_src

*** Paredit
#+BEGIN_SRC emacs-lisp
  (autoload 'enable-paredit-mode "paredit" "Turn on pseudo-structural editing of Lisp code." t)
  (add-hook 'emacs-lisp-mode-hook       'enable-paredit-mode)
  (add-hook 'eval-expression-minibuffer-setup-hook 'enable-paredit-mode)
  (add-hook 'lisp-mode-hook             'enable-paredit-mode)
  (add-hook 'lisp-interaction-mode-hook 'enable-paredit-mode)
  (add-hook 'slime-repl-mode-hook 'enable-paredit-mode)

  (eval-after-load 'paredit
    '(define-key paredit-mode-map (kbd "[") 'paredit-open-round))
  (eval-after-load 'paredit
    '(define-key paredit-mode-map (kbd "]") 'paredit-close-round))
  (eval-after-load 'paredit
    '(define-key paredit-mode-map (kbd "M-[") 'paredit-wrap-round))
  (eval-after-load 'paredit
    '(define-key paredit-mode-map (kbd "(") 'paredit-open-square))
  (eval-after-load 'paredit
    '(define-key paredit-mode-map (kbd ")") 'paredit-close-square))

  (eval-after-load 'paredit
    '(define-key paredit-mode-map (kbd "C-c C-f") 'paredit-forward))
  (eval-after-load 'paredit
    '(define-key paredit-mode-map (kbd "C-c C-b") 'paredit-backward))

#+END_SRC

