.emacs.d/emacs.html
<div id="outline-container-sec-8-30" class="outline-3">
<h3 id="sec-8-30"><span class="section-number-3">8.30</span> Auto Completion</h3>
<div class="outline-text-3" id="text-8-30">
<p>
There are two main auto-completes for Emacs; Auto-complete, and Company-mode.
</p>

<p>
From <a href="https://github.com/auto-complete/auto-complete">https://github.com/auto-complete/auto-complete</a>
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">if</span> t
    <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">progn</span>
      <span style="color: #D0BF8F;">(</span><span style="color: #F0DFAF; font-weight: bold;">require</span> '<span style="color: #BFEBBF;">company</span><span style="color: #D0BF8F;">)</span>
      <span style="color: #D0BF8F;">(</span>add-hook 'emacs-lisp-mode-hook 'company-mode<span style="color: #D0BF8F;">)</span>
      <span style="color: #D0BF8F;">(</span>add-hook 'emacs-lisp-mode-hook 'company-mode 'append<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">progn</span>
    <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">(require 'auto-complete)</span>
    <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">(require 'auto-complete-config)</span>
    <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">(ac-config-default)</span>
    <span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-8-31" class="outline-3">
<h3 id="sec-8-31"><span class="section-number-3">8.31</span> Smart Home</h3>
<div class="outline-text-3" id="text-8-31">
<p>
Currently not enabled as Org-Mode does a better job.
<a href="http://stackoverflow.com/questions/145291/smart-home-in-emacs">http://stackoverflow.com/questions/145291/smart-home-in-emacs</a>
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">smart-beginning-of-line</span> <span style="color: #BFEBBF;">()</span>
  <span style="color: #9FC59F;">"Move point to first non-whitespace character or beginning-of-line.</span>

<span style="color: #9FC59F;">Move point to the first non-whitespace character on this line.</span>
<span style="color: #9FC59F;">If point was already at that position, move point to beginning of line."</span>
  <span style="color: #BFEBBF;">(</span>interactive<span style="color: #BFEBBF;">)</span> <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">Use (interactive "^") in Emacs 23 to make shift-select work</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">let</span> <span style="color: #D0BF8F;">(</span><span style="color: #93E0E3;">(</span>oldpos <span style="color: #9FC59F;">(</span>point<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span>back-to-indentation<span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span>and <span style="color: #93E0E3;">(</span>= oldpos <span style="color: #9FC59F;">(</span>point<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span>
         <span style="color: #93E0E3;">(</span>beginning-of-line<span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>

<span style="color: #5F7F5F;">;;</span><span style="color: #7F9F7F;">(global-set-key [home] 'smart-beginning-of-line)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-8-32" class="outline-3">
<h3 id="sec-8-32"><span class="section-number-3">8.32</span> Common Lisp Editing</h3>
<div class="outline-text-3" id="text-8-32">
</div><div id="outline-container-sec-8-32-1" class="outline-4">
<h4 id="sec-8-32-1"><span class="section-number-4">8.32.1</span> Associate ASDF File Extensions to Major Modes</h4>
<div class="outline-text-4" id="text-8-32-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span>add-to-list 'auto-mode-alist '<span style="color: #BFEBBF;">(</span><span style="color: #CC9393;">"\\.asd$"</span> . lisp-mode<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span> <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Allow ASDF files to be edited as lisp files</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-8-32-2" class="outline-4">
<h4 id="sec-8-32-2"><span class="section-number-4">8.32.2</span> Paredit</h4>
<div class="outline-text-4" id="text-8-32-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span>autoload 'enable-paredit-mode <span style="color: #CC9393;">"paredit"</span> <span style="color: #9FC59F;">"Turn on pseudo-structural editing of Lisp code."</span> t<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>add-hook 'emacs-lisp-mode-hook       'enable-paredit-mode<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>add-hook 'eval-expression-minibuffer-setup-hook 'enable-paredit-mode<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>add-hook 'lisp-mode-hook             'enable-paredit-mode<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>add-hook 'lisp-interaction-mode-hook 'enable-paredit-mode<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>add-hook 'slime-repl-mode-hook 'enable-paredit-mode<span style="color: #DCDCCC;">)</span>

<span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">eval-after-load</span> 'paredit
  '<span style="color: #BFEBBF;">(</span>define-key paredit-mode-map <span style="color: #D0BF8F;">(</span>kbd <span style="color: #CC9393;">"["</span><span style="color: #D0BF8F;">)</span> 'paredit-open-round<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">eval-after-load</span> 'paredit
  '<span style="color: #BFEBBF;">(</span>define-key paredit-mode-map <span style="color: #D0BF8F;">(</span>kbd <span style="color: #CC9393;">"]"</span><span style="color: #D0BF8F;">)</span> 'paredit-close-round<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">eval-after-load</span> 'paredit
  '<span style="color: #BFEBBF;">(</span>define-key paredit-mode-map <span style="color: #D0BF8F;">(</span>kbd <span style="color: #CC9393;">"M-["</span><span style="color: #D0BF8F;">)</span> 'paredit-wrap-round<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">eval-after-load</span> 'paredit
  '<span style="color: #BFEBBF;">(</span>define-key paredit-mode-map <span style="color: #D0BF8F;">(</span>kbd <span style="color: #CC9393;">"("</span><span style="color: #D0BF8F;">)</span> 'paredit-open-square<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">eval-after-load</span> 'paredit
  '<span style="color: #BFEBBF;">(</span>define-key paredit-mode-map <span style="color: #D0BF8F;">(</span>kbd <span style="color: #CC9393;">")"</span><span style="color: #D0BF8F;">)</span> 'paredit-close-square<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>

<span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">eval-after-load</span> 'paredit
  '<span style="color: #BFEBBF;">(</span>define-key paredit-mode-map <span style="color: #D0BF8F;">(</span>kbd <span style="color: #CC9393;">"C-c C-f"</span><span style="color: #D0BF8F;">)</span> 'paredit-forward<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">eval-after-load</span> 'paredit
  '<span style="color: #BFEBBF;">(</span>define-key paredit-mode-map <span style="color: #D0BF8F;">(</span>kbd <span style="color: #CC9393;">"C-c C-b"</span><span style="color: #D0BF8F;">)</span> 'paredit-backward<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
