.emacs.d/emacs.el
      (require 'company)
      (add-hook 'emacs-lisp-mode-hook 'company-mode)
      (add-hook 'emacs-lisp-mode-hook 'company-mode 'append))
  (progn
    ;; (require 'auto-complete)
    ;; (require 'auto-complete-config)
    ;; (ac-config-default)
    ))

;(require 'undo-tree)

;(global-undo-tree-mode)

;(defalias 'redo 'undo-tree-redo)
;(global-set-key [(control z)] 'undo) ; [Ctrl+z]
;(global-set-key [(control shift z)] 'redo) ; [Ctrl+Shift+z];  Mac style  
;(global-set-key [(control y)] 'redo) ; [Ctrl+y]; Microsoft Windows style

(defun smart-beginning-of-line ()
  "Move point to first non-whitespace character or beginning-of-line.

Move point to the first non-whitespace character on this line.
If point was already at that position, move point to beginning of line."
  (interactive) ; Use (interactive "^") in Emacs 23 to make shift-select work
  (let ((oldpos (point)))
    (back-to-indentation)
    (and (= oldpos (point))
         (beginning-of-line))))

;;(global-set-key [home] 'smart-beginning-of-line)

(add-to-list 'auto-mode-alist '("\\.asd$" . lisp-mode)) ;; Allow ASDF files to be edited as lisp files

(autoload 'enable-paredit-mode "paredit" "Turn on pseudo-structural editing of Lisp code." t)
(add-hook 'emacs-lisp-mode-hook       'enable-paredit-mode)
(add-hook 'eval-expression-minibuffer-setup-hook 'enable-paredit-mode)
(add-hook 'lisp-mode-hook             'enable-paredit-mode)
(add-hook 'lisp-interaction-mode-hook 'enable-paredit-mode)
(add-hook 'slime-repl-mode-hook 'enable-paredit-mode)

(eval-after-load 'paredit
  '(define-key paredit-mode-map (kbd "[") 'paredit-open-round))
(eval-after-load 'paredit
  '(define-key paredit-mode-map (kbd "]") 'paredit-close-round))
(eval-after-load 'paredit
  '(define-key paredit-mode-map (kbd "M-[") 'paredit-wrap-round))
(eval-after-load 'paredit
  '(define-key paredit-mode-map (kbd "(") 'paredit-open-square))
(eval-after-load 'paredit
  '(define-key paredit-mode-map (kbd ")") 'paredit-close-square))

(eval-after-load 'paredit
  '(define-key paredit-mode-map (kbd "C-c C-f") 'paredit-forward))
(eval-after-load 'paredit
  '(define-key paredit-mode-map (kbd "C-c C-b") 'paredit-backward))
