.emacs.d/emacs.org
*** Highlighting Parenthesis
#+BEGIN_SRC emacs-lisp
  ;;  M-x list-colors-display 

  (when nil
    (require 'highlight-sexps) ;; Highlights the nested expressions surrounding the point
    (autoload 'highlight-sexps-mode "highlight-sexps-mode" "Turn on highlighting of sexps." t)
    (add-hook 'lisp-mode-hook 'highlight-sexps-mode)
    (add-hook 'emacs-lisp-mode-hook 'highlight-sexps-mode)
    (add-hook 'eval-expression-minibuffer-setup-hook 'highlight-sexps-mode)
    (add-hook 'lisp-interaction-mode-hook 'highlight-sexps-mode)
    (add-hook 'slime-repl-mode-hook 'highlight-sexps-mode)
    (setq hl-sexp-background-colors '("Gray10" "Gray20")))

  ;; show-paren-mode allows one to see matching pairs of parentheses and other characters. 
  ;; When point is on one of the paired characters, the other is highlighted. 
  (when nil
    (show-paren-mode 0)
    (setq show-paren-style 'expression))  ; 'parenthesis highlight just brackets
                                          ; 'expression highlight entire bracket expression

  (when nil
    (require 'parenface) ; Dims parenthesis
    (eval-after-load 'parenface
      (progn
        (set-face-foreground 'parenface-paren-face "SteelBlue4")
        (set-face-foreground 'parenface-bracket-face "SteelBlue4")
        (set-face-foreground 'parenface-curly-face "SteelBlue4"))))

  (when t
    (require 'rainbow-delimiters) ;; highlights parens, brackets, and braces according to their depth
    ;; (add-hook 'prog-mode-hook 'rainbow-delimiters-mode) ; Add to all programming modes
    (add-hook 'lisp-mode-hook 'rainbow-delimiters-mode)
    (add-hook 'emacs-lisp-mode-hook 'rainbow-delimiters-mode)
    (add-hook 'eval-expression-minibuffer-setup-hook 'rainbow-delimiters-mode)
    (add-hook 'lisp-interaction-mode-hook 'rainbow-delimiters-mode)
    (add-hook 'slime-repl-mode-hook 'rainbow-delimiters-mode))

  (when t
    (require 'highlight-sexp) ;; Highlights the sexp at the current position
    (add-hook 'lisp-mode-hook 'highlight-sexp-mode)
    (add-hook 'emacs-lisp-mode-hook 'highlight-sexp-mode)
    (add-hook 'eval-expression-minibuffer-setup-hook 'highlight-sexp-mode)
    (add-hook 'lisp-interaction-mode-hook 'highlight-sexp-mode)
    (add-hook 'slime-repl-mode-hook 'highlight-sexp-mode))
#+END_SRC

