.emacs.d/emacs.html

<div id="outline-container-sec-8-32-3" class="outline-4">
<h4 id="sec-8-32-3"><span class="section-number-4">8.32.3</span> Highlighting Parenthesis</h4>
<div class="outline-text-4" id="text-8-32-3">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #5F7F5F;">;;  </span><span style="color: #7F9F7F;">M-x list-colors-display </span>

<span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">when</span> nil
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">require</span> '<span style="color: #BFEBBF;">highlight-sexps</span><span style="color: #BFEBBF;">)</span> <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Highlights the nested expressions surrounding the point</span>
  <span style="color: #BFEBBF;">(</span>autoload 'highlight-sexps-mode <span style="color: #CC9393;">"highlight-sexps-mode"</span> <span style="color: #9FC59F;">"Turn on highlighting of sexps."</span> t<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>add-hook 'lisp-mode-hook 'highlight-sexps-mode<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>add-hook 'emacs-lisp-mode-hook 'highlight-sexps-mode<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>add-hook 'eval-expression-minibuffer-setup-hook 'highlight-sexps-mode<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>add-hook 'lisp-interaction-mode-hook 'highlight-sexps-mode<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>add-hook 'slime-repl-mode-hook 'highlight-sexps-mode<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>setq hl-sexp-background-colors '<span style="color: #D0BF8F;">(</span><span style="color: #CC9393;">"Gray10"</span> <span style="color: #CC9393;">"Gray40"</span> <span style="color: #CC9393;">"Gray50"</span> <span style="color: #CC9393;">"Gray60"</span> <span style="color: #CC9393;">"Gray70"</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">show-paren-mode allows one to see matching pairs of parentheses and other characters. </span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">When point is on one of the paired characters, the other is highlighted. </span>
<span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">when</span> nil
  <span style="color: #BFEBBF;">(</span>show-paren-mode 0<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>setq show-paren-style 'expression<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>  <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">'parenthesis highlight just brackets</span>
                                        <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">'expression highlight entire bracket expression</span>

<span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">when</span> nil
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">require</span> '<span style="color: #BFEBBF;">parenface</span><span style="color: #BFEBBF;">)</span> <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">Dims parenthesis</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">eval-after-load</span> 'parenface
    <span style="color: #D0BF8F;">(</span><span style="color: #F0DFAF; font-weight: bold;">progn</span>
      <span style="color: #93E0E3;">(</span>set-face-foreground 'parenface-paren-face <span style="color: #CC9393;">"SteelBlue4"</span><span style="color: #93E0E3;">)</span>
      <span style="color: #93E0E3;">(</span>set-face-foreground 'parenface-bracket-face <span style="color: #CC9393;">"SteelBlue4"</span><span style="color: #93E0E3;">)</span>
      <span style="color: #93E0E3;">(</span>set-face-foreground 'parenface-curly-face <span style="color: #CC9393;">"SteelBlue4"</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>

<span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">when</span> t
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">require</span> '<span style="color: #BFEBBF;">rainbow-delimiters</span><span style="color: #BFEBBF;">)</span> <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">highlights parens, brackets, and braces according to their depth</span>
  <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">(add-hook 'prog-mode-hook 'rainbow-delimiters-mode) ; Add to all programming modes</span>
  <span style="color: #BFEBBF;">(</span>add-hook 'lisp-mode-hook 'rainbow-delimiters-mode<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>add-hook 'emacs-lisp-mode-hook 'rainbow-delimiters-mode<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>add-hook 'eval-expression-minibuffer-setup-hook 'rainbow-delimiters-mode<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>add-hook 'lisp-interaction-mode-hook 'rainbow-delimiters-mode<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>add-hook 'slime-repl-mode-hook 'rainbow-delimiters-mode<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>

<span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">when</span> t
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">require</span> '<span style="color: #BFEBBF;">highlight-sexp</span><span style="color: #BFEBBF;">)</span> <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Highlights the sexp at the current position</span>
  <span style="color: #BFEBBF;">(</span>add-hook 'lisp-mode-hook 'highlight-sexp-mode<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>add-hook 'emacs-lisp-mode-hook 'highlight-sexp-mode<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>add-hook 'eval-expression-minibuffer-setup-hook 'highlight-sexp-mode<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>add-hook 'lisp-interaction-mode-hook 'highlight-sexp-mode<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>add-hook 'slime-repl-mode-hook 'highlight-sexp-mode<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
</div>
