.emacs.d/emacs.org
** Naked Emacs
http://bzg.fr/emacs-strip-tease.html

#+BEGIN_SRC emacs-lisp

  ;; Prevent the cursor from blinking
  (blink-cursor-mode 0)

  ;; Use a minimal cursor
  (setq default-cursor-type 'hbar)

  ;; You need to set `inhibit-startup-echo-area-message' from the
  ;; customization interface:
  ;; M-x customize-variable RET inhibit-startup-echo-area-message RET
  ;; then enter your username
  ;;(setq inhibit-startup-echo-area-message "guerry")

  ;; Remove the toolbar
  (tool-bar-mode 0)

  ;; Turn of the menu bar
  (menu-bar-mode 0)

  ;; Turn off the scroll bar
  (scroll-bar-mode 0)

  ;; See http://bzg.fr/emacs-hide-mode-line.html
  (defvar-local hidden-mode-line-mode nil)
  (defvar-local hide-mode-line nil)

    (define-minor-mode hidden-mode-line-mode
      "Minor mode to hide the mode-line in the current buffer."
      :init-value nil
      :global nil
      :variable hidden-mode-line-mode
      :group 'editing-basics
      (if hidden-mode-line-mode
          (setq hide-mode-line mode-line-format
                mode-line-format nil)
        (setq mode-line-format hide-mode-line
              hide-mode-line nil))
      (force-mode-line-update)
      ;; Apparently force-mode-line-update is not always enough to
      ;; redisplay the mode-line
      (redraw-display)
      (when (and (called-interactively-p 'interactive)
                 hidden-mode-line-mode)
        (run-with-idle-timer
         0 nil 'message
         (concat "Hidden Mode Line Mode enabled.  "
                 "Use M-x hidden-mode-line-mode to make the mode-line appear."))))

  ;; Command to toggle the display of the mode-line as a header
  (defvar-local header-line-format nil)
  (defun mode-line-in-header ()
    (interactive)
    (if (not header-line-format)
        (setq header-line-format mode-line-format
              mode-line-format nil)
      (setq mode-line-format header-line-format
            header-line-format nil))
    (set-window-buffer nil (current-buffer)))
  (global-set-key (kbd "C-s-SPC") 'mode-line-in-header)


  ;; Activate hidden-mode-line-mode
  (hidden-mode-line-mode 1)

  ;; A small minor mode to use a big fringe
  (defvar bzg-big-fringe-mode nil)
  (define-minor-mode bzg-big-fringe-mode
    "Minor mode to use big fringe in the current buffer."
    :init-value nil
    :global t
    :variable bzg-big-fringe-mode
    :group 'editing-basics
    (if (not bzg-big-fringe-mode)
        (set-fringe-style nil)
      (set-fringe-mode
       (/ (- (frame-pixel-width)
             (* 100 (frame-char-width)))
          2))))

  ;; Now activate this global minor mode
  (bzg-big-fringe-mode 0)

  ;; To activate the fringe by default and deactivate it when windows
  ;; are split vertically, uncomment this:
  ;; (add-hook 'window-configuration-change-hook
  ;;           (lambda ()
  ;;             (if (delq nil
  ;;                       (let ((fw (frame-width)))
  ;;                         (mapcar (lambda(w) (< (window-width w) fw))
  ;;                                 (window-list))))
  ;;                 (bzg-big-fringe-mode 0)
  ;;               (bzg-big-fringe-mode 1))))

  ;; Get rid of the indicators in the fringe
  (mapcar (lambda(fb) (set-fringe-bitmap-face fb 'org-hide))
          fringe-bitmaps)

  ;; Set the color of the fringe
  ;;(custom-set-faces
  ;; '(fringe ((t (:background "white")))))
   
  ;;(custom-set-faces
  ;;  '(default ((t (:background "black" :foreground "grey"))))
  ;;  '(fringe ((t (:background "black")))))

#+END_SRC

