.emacs.d/emacs.html

<div id="outline-container-sec-8-33" class="outline-3">
<h3 id="sec-8-33"><span class="section-number-3">8.33</span> Naked Emacs</h3>
<div class="outline-text-3" id="text-8-33">
<p>
<a href="http://bzg.fr/emacs-strip-tease.html">http://bzg.fr/emacs-strip-tease.html</a>
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Prevent the cursor from blinking</span>
<span style="color: #DCDCCC;">(</span>blink-cursor-mode 0<span style="color: #DCDCCC;">)</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Use a minimal cursor</span>
<span style="color: #DCDCCC;">(</span>setq default-cursor-type 'hbar<span style="color: #DCDCCC;">)</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Don't use messages that you don't read</span>
<span style="color: #DCDCCC;">(</span>setq initial-scratch-message <span style="color: #CC9393;">""</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>setq inhibit-startup-message t<span style="color: #DCDCCC;">)</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Don't let Emacs hurt your ears when t</span>
<span style="color: #DCDCCC;">(</span>setq visible-bell t<span style="color: #DCDCCC;">)</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">You need to set `</span><span style="color: #7F9F7F;">inhibit-startup-echo-area-message</span><span style="color: #7F9F7F;">' from the</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">customization interface:</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">M-x customize-variable RET inhibit-startup-echo-area-message RET</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">then enter your username</span>
<span style="color: #5F7F5F;">;;</span><span style="color: #7F9F7F;">(setq inhibit-startup-echo-area-message "guerry")</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Remove the toolbar</span>
<span style="color: #DCDCCC;">(</span>tool-bar-mode 0<span style="color: #DCDCCC;">)</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Turn of the menu bar</span>
<span style="color: #DCDCCC;">(</span>menu-bar-mode 0<span style="color: #DCDCCC;">)</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Turn off the scroll bar</span>
<span style="color: #DCDCCC;">(</span>scroll-bar-mode 0<span style="color: #DCDCCC;">)</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">See http://bzg.fr/emacs-hide-mode-line.html</span>
<span style="color: #DCDCCC;">(</span>defvar-local hidden-mode-line-mode nil<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>defvar-local hide-mode-line nil<span style="color: #DCDCCC;">)</span>

  <span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">define-minor-mode</span> <span style="color: #93E0E3;">hidden-mode-line-mode</span>
    <span style="color: #9FC59F;">"Minor mode to hide the mode-line in the current buffer."</span>
    <span style="color: #DCDCCC; font-weight: bold;">:init-value</span> nil
    <span style="color: #DCDCCC; font-weight: bold;">:global</span> nil
    <span style="color: #DCDCCC; font-weight: bold;">:variable</span> hidden-mode-line-mode
    <span style="color: #DCDCCC; font-weight: bold;">:group</span> 'editing-basics
    <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">if</span> hidden-mode-line-mode
        <span style="color: #D0BF8F;">(</span>setq hide-mode-line mode-line-format
              mode-line-format nil<span style="color: #D0BF8F;">)</span>
      <span style="color: #D0BF8F;">(</span>setq mode-line-format hide-mode-line
            hide-mode-line nil<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span>
    <span style="color: #BFEBBF;">(</span>force-mode-line-update<span style="color: #BFEBBF;">)</span>
    <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Apparently force-mode-line-update is not always enough to</span>
    <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">redisplay the mode-line</span>
    <span style="color: #BFEBBF;">(</span>redraw-display<span style="color: #BFEBBF;">)</span>
    <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">when</span> <span style="color: #D0BF8F;">(</span>and <span style="color: #93E0E3;">(</span>called-interactively-p 'interactive<span style="color: #93E0E3;">)</span>
               hidden-mode-line-mode<span style="color: #D0BF8F;">)</span>
      <span style="color: #D0BF8F;">(</span>run-with-idle-timer
       0 nil 'message
       <span style="color: #93E0E3;">(</span>concat <span style="color: #CC9393;">"Hidden Mode Line Mode enabled.  "</span>
               <span style="color: #CC9393;">"Use M-x hidden-mode-line-mode to make the mode-line appear."</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Command to toggle the display of the mode-line as a header</span>
<span style="color: #DCDCCC;">(</span>defvar-local header-line-format nil<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">mode-line-in-header</span> <span style="color: #BFEBBF;">()</span>
  <span style="color: #BFEBBF;">(</span>interactive<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">if</span> <span style="color: #D0BF8F;">(</span>not header-line-format<span style="color: #D0BF8F;">)</span>
      <span style="color: #D0BF8F;">(</span>setq header-line-format mode-line-format
            mode-line-format nil<span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span>setq mode-line-format header-line-format
          header-line-format nil<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>set-window-buffer nil <span style="color: #D0BF8F;">(</span>current-buffer<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>global-set-key <span style="color: #BFEBBF;">(</span>kbd <span style="color: #CC9393;">"C-s-SPC"</span><span style="color: #BFEBBF;">)</span> 'mode-line-in-header<span style="color: #DCDCCC;">)</span>


<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Activate hidden-mode-line-mode</span>
<span style="color: #DCDCCC;">(</span>hidden-mode-line-mode 1<span style="color: #DCDCCC;">)</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">A small minor mode to use a big fringe</span>
<span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defvar</span> <span style="color: #DFAF8F;">bzg-big-fringe-mode</span> nil<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">define-minor-mode</span> <span style="color: #93E0E3;">bzg-big-fringe-mode</span>
  <span style="color: #9FC59F;">"Minor mode to use big fringe in the current buffer."</span>
  <span style="color: #DCDCCC; font-weight: bold;">:init-value</span> nil
  <span style="color: #DCDCCC; font-weight: bold;">:global</span> t
  <span style="color: #DCDCCC; font-weight: bold;">:variable</span> bzg-big-fringe-mode
  <span style="color: #DCDCCC; font-weight: bold;">:group</span> 'editing-basics
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">if</span> <span style="color: #D0BF8F;">(</span>not bzg-big-fringe-mode<span style="color: #D0BF8F;">)</span>
      <span style="color: #D0BF8F;">(</span>set-fringe-style nil<span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span>set-fringe-mode
     <span style="color: #93E0E3;">(</span>/ <span style="color: #9FC59F;">(</span>- <span style="color: #94BFF3;">(</span>frame-pixel-width<span style="color: #94BFF3;">)</span>
           <span style="color: #94BFF3;">(</span>* 100 <span style="color: #E0CF9F;">(</span>frame-char-width<span style="color: #E0CF9F;">)</span><span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span>
        2<span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Now activate this global minor mode</span>
<span style="color: #DCDCCC;">(</span>bzg-big-fringe-mode 0<span style="color: #DCDCCC;">)</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">To activate the fringe by default and deactivate it when windows</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">are split vertically, uncomment this:</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">(add-hook 'window-configuration-change-hook</span>
<span style="color: #5F7F5F;">;;           </span><span style="color: #7F9F7F;">(lambda ()</span>
<span style="color: #5F7F5F;">;;             </span><span style="color: #7F9F7F;">(if (delq nil</span>
<span style="color: #5F7F5F;">;;                       </span><span style="color: #7F9F7F;">(let ((fw (frame-width)))</span>
<span style="color: #5F7F5F;">;;                         </span><span style="color: #7F9F7F;">(mapcar (lambda(w) (&lt; (window-width w) fw))</span>
<span style="color: #5F7F5F;">;;                                 </span><span style="color: #7F9F7F;">(window-list))))</span>
<span style="color: #5F7F5F;">;;                 </span><span style="color: #7F9F7F;">(bzg-big-fringe-mode 0)</span>
<span style="color: #5F7F5F;">;;               </span><span style="color: #7F9F7F;">(bzg-big-fringe-mode 1))))</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Get rid of the indicators in the fringe</span>
<span style="color: #DCDCCC;">(</span>mapcar <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">lambda</span><span style="color: #D0BF8F;">(</span>fb<span style="color: #D0BF8F;">)</span> <span style="color: #D0BF8F;">(</span>set-fringe-bitmap-face fb 'org-hide<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span>
        fringe-bitmaps<span style="color: #DCDCCC;">)</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Set the color of the fringe</span>
<span style="color: #5F7F5F;">;;</span><span style="color: #7F9F7F;">(custom-set-faces</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">'(fringe ((t (:background "white")))))</span>

<span style="color: #5F7F5F;">;;</span><span style="color: #7F9F7F;">(custom-set-faces</span>
<span style="color: #5F7F5F;">;;  </span><span style="color: #7F9F7F;">'(default ((t (:background "black" :foreground "grey"))))</span>
<span style="color: #5F7F5F;">;;  </span><span style="color: #7F9F7F;">'(fringe ((t (:background "black")))))</span>
</pre>
</div>
</div>
</div>
