.emacs.d/emacs.org
** Spelling (Hunspell)
#+BEGIN_SRC emacs-lisp
  ;; Replace ispell with hunspell
  (when (executable-find "hunspell")
    (setq-default ispell-program-name "hunspell")
    (setq ispell-really-hunspell t)
    ;;(setq ispell-extra-args '("-a" "-i" "utf-8"))
    (setq ispell-extra-args '("-i" "utf-8"))
    ;;(setq ispell-extra-args nil)
    (setq ispell-local-dictionary-alist (list 
                                         (list "american-hunspell"
                                               "[[:alpha:]]"
                                               "[^[:alpha:]]"
                                               "[']"
                                               t
                                               (list "-d" 
                                                     (expand-file-name "dict/en_US" 
                                                                       use-hunspell))
                                               nil
                                               'utf-8)))
    (setq ispell-dictionary "american-hunspell"))
#+END_SRC
** Highlight cursor line
#+BEGIN_SRC emacs-lisp
(global-hl-line-mode t)
#+END_SRC

** Aggressive Indent Mode
#+BEGIN_SRC emacs-lisp
  ;;(require 'aggressive-indent)

#+END_SRC
* Version Control
** Ediff
#+begin_src emacs-lisp
  (defconst ediff-ignore-similar-regions t)
  (defconst ediff-use-last-dir t)
  (defconst ediff-diff-options " -b ")
#+end_src

** Magit
https://github.comk/magit/magit
#+begin_src emacs-lisp
  (eval-after-load 'info
    '(progn (info-initialize)
            (add-to-list 'Info-directory-list (expand-file-name "magit-master" use-home/site))))
  ;;(require 'git-commit-mode)
  ;;(require 'git-rebase-mode)
  (require 'magit)

  (global-set-key [(control x) (g)] 'magit-status)
  (global-set-key (quote [f9]) 'magit-status)

  ;; This is here to stop the following error in Magit;
  ;; "The directory ~/.emacs.d/server is unsafe"
  (require 'server)
  (and (>= emacs-major-version 23)
       (defun server-ensure-safe-dir (dir) "Noop" t))
#+end_src

* Color Theme
Themes include;

| adwaita    | deeper-blue | dichromacy      | light-blue       |
| manoj-dark | misterioso  | solarized-dark* | solarized-light* |
| tango      | tango-dark  | tsdh-dark       | tsdh-light       |
| wheatgrass | whiteboard  | wombat          | zenburn          |

 * Not distributed as part of Emacs, but a nice theme anyway.
   
 https://github.com/bbatsov/solarized-emacs
 
 #+begin_src emacs-lisp
   ;(load-theme 'manoj-dark t)
   (load-theme 'zenburn t)
   ;(load-theme 'whiteboard t)
 #+end_src
 
* Mode-Line Customizations
** Smart-Mode-Line
https://github.com/Bruce-Connor/smart-mode-line/
#+BEGIN_SRC emacs-lisp
(require 'rich-minority)
(require 'smart-mode-line)

(setq sml/no-confirm-load-theme t)
(sml/setup)

(sml/apply-theme 'dark)
;(sml/apply-theme 'light)
;(sml/apply-theme 'respectful)
;(sml/apply-theme 'automatic)
#+END_SRC

** Powerline
https://github.com/milkypostman/powerline
#+BEGIN_SRC emacs-lisp    
  (require 'powerline)
  
  ;(powerline-default-theme)
  (powerline-center-theme)
#+END_SRC
* ORG-mode
