.emacs.d/emacs.html

<div id="outline-container-sec-8-34" class="outline-3">
<h3 id="sec-8-34"><span class="section-number-3">8.34</span> Spelling</h3>
<div class="outline-text-3" id="text-8-34">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Replace ispell with hunspell</span>
<span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">when</span> <span style="color: #BFEBBF;">(</span>executable-find <span style="color: #CC9393;">"hunspell"</span><span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>setq-default ispell-program-name <span style="color: #CC9393;">"hunspell"</span><span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>setq ispell-really-hunspell t<span style="color: #BFEBBF;">)</span>
  <span style="color: #5F7F5F;">;;</span><span style="color: #7F9F7F;">(setq ispell-extra-args '("-a" "-i" "utf-8"))</span>
  <span style="color: #BFEBBF;">(</span>setq ispell-extra-args '<span style="color: #D0BF8F;">(</span><span style="color: #CC9393;">"-i"</span> <span style="color: #CC9393;">"utf-8"</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span>
  <span style="color: #5F7F5F;">;;</span><span style="color: #7F9F7F;">(setq ispell-extra-args nil)</span>
  <span style="color: #BFEBBF;">(</span>setq ispell-local-dictionary-alist <span style="color: #D0BF8F;">(</span>list 
                                       <span style="color: #93E0E3;">(</span>list <span style="color: #CC9393;">"american-hunspell"</span>
                                             <span style="color: #CC9393;">"[[:alpha:]]"</span>
                                             <span style="color: #CC9393;">"[</span><span style="color: #CC9393; font-weight: bold;">^</span><span style="color: #CC9393;">[:alpha:]]"</span>
                                             <span style="color: #CC9393;">"[']"</span>
                                             t
                                             <span style="color: #9FC59F;">(</span>list <span style="color: #CC9393;">"-d"</span> 
                                                   <span style="color: #94BFF3;">(</span>expand-file-name <span style="color: #CC9393;">"dict/en_US"</span> 
                                                                     use-hunspell<span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span>
                                             nil
                                             'utf-8<span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>setq ispell-dictionary <span style="color: #CC9393;">"american-hunspell"</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-8-35" class="outline-3">
<h3 id="sec-8-35"><span class="section-number-3">8.35</span> Highlight cursor line</h3>
<div class="outline-text-3" id="text-8-35">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span>global-hl-line-mode t<span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Version Control</h2>
<div class="outline-text-2" id="text-9">
</div><div id="outline-container-sec-9-1" class="outline-3">
<h3 id="sec-9-1"><span class="section-number-3">9.1</span> Ediff</h3>
<div class="outline-text-3" id="text-9-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defconst</span> <span style="color: #DFAF8F;">ediff-ignore-similar-regions</span> t<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defconst</span> <span style="color: #DFAF8F;">ediff-use-last-dir</span> t<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defconst</span> <span style="color: #DFAF8F;">ediff-diff-options</span> <span style="color: #CC9393;">" -b "</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-9-2" class="outline-3">
<h3 id="sec-9-2"><span class="section-number-3">9.2</span> Magit</h3>
<div class="outline-text-3" id="text-9-2">
<p>
<a href="https://github.comk/magit/magit">https://github.comk/magit/magit</a>
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">require</span> '<span style="color: #BFEBBF;">git-commit-mode</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">require</span> '<span style="color: #BFEBBF;">git-rebase-mode</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">require</span> '<span style="color: #BFEBBF;">magit</span><span style="color: #DCDCCC;">)</span>

<span style="color: #DCDCCC;">(</span>global-set-key <span style="color: #BFEBBF;">[</span><span style="color: #D0BF8F;">(</span>control x<span style="color: #D0BF8F;">)</span> <span style="color: #D0BF8F;">(</span>g<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">]</span> 'magit-status<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>global-set-key <span style="color: #BFEBBF;">(</span>quote <span style="color: #D0BF8F;">[</span>f9<span style="color: #D0BF8F;">]</span><span style="color: #BFEBBF;">)</span> 'magit-status<span style="color: #DCDCCC;">)</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">This is here to stop the following error in Magit;</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">"The directory ~/.emacs.d/server is unsafe"</span>
<span style="color: #DCDCCC;">(</span>and <span style="color: #BFEBBF;">(</span>&gt;= emacs-major-version 23<span style="color: #BFEBBF;">)</span>
     <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">server-ensure-safe-dir</span> <span style="color: #D0BF8F;">(</span>dir<span style="color: #D0BF8F;">)</span> <span style="color: #9FC59F;">"Noop"</span> t<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Color Theme</h2>
<div class="outline-text-2" id="text-10">
<p>
Themes include;
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">adwaita</td>
<td class="left">deeper-blue</td>
<td class="left">dichromacy</td>
<td class="left">light-blue</td>
</tr>

<tr>
<td class="left">manoj-dark</td>
<td class="left">misterioso</td>
<td class="left">solarized-dark*</td>
<td class="left">solarized-light*</td>
</tr>

<tr>
<td class="left">tango</td>
<td class="left">tango-dark</td>
<td class="left">tsdh-dark</td>
<td class="left">tsdh-light</td>
</tr>

<tr>
<td class="left">wheatgrass</td>
<td class="left">whiteboard</td>
<td class="left">wombat</td>
<td class="left">zenburn</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>Not distributed as part of Emacs, but a nice theme anyway.
</li>
</ul>

<p>
<a href="https://github.com/bbatsov/solarized-emacs">https://github.com/bbatsov/solarized-emacs</a>
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">(load-theme 'manoj-dark t)</span>
<span style="color: #DCDCCC;">(</span>load-theme 'zenburn t<span style="color: #DCDCCC;">)</span>
<span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">(load-theme 'whiteboard t)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> Mode-Line Customizations</h2>
<div class="outline-text-2" id="text-11">
</div><div id="outline-container-sec-11-1" class="outline-3">
<h3 id="sec-11-1"><span class="section-number-3">11.1</span> Smart-Mode-Line</h3>
<div class="outline-text-3" id="text-11-1">
<p>
<a href="https://github.com/Bruce-Connor/smart-mode-line/">https://github.com/Bruce-Connor/smart-mode-line/</a>
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">require</span> '<span style="color: #BFEBBF;">rich-minority</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">require</span> '<span style="color: #BFEBBF;">smart-mode-line</span><span style="color: #DCDCCC;">)</span>

<span style="color: #DCDCCC;">(</span>setq sml/no-confirm-load-theme t<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>sml/setup<span style="color: #DCDCCC;">)</span>

<span style="color: #DCDCCC;">(</span>sml/apply-theme 'dark<span style="color: #DCDCCC;">)</span>
<span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">(sml/apply-theme 'light)</span>
<span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">(sml/apply-theme 'respectful)</span>
<span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">(sml/apply-theme 'automatic)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-11-2" class="outline-3">
<h3 id="sec-11-2"><span class="section-number-3">11.2</span> Powerline</h3>
<div class="outline-text-3" id="text-11-2">
<p>
<a href="https://github.com/milkypostman/powerline">https://github.com/milkypostman/powerline</a>
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">require</span> '<span style="color: #BFEBBF;">powerline</span><span style="color: #DCDCCC;">)</span>

<span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">(powerline-default-theme)</span>
<span style="color: #DCDCCC;">(</span>powerline-center-theme<span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
</div>
