.emacs.d/emacs.el

;; Replace ispell with hunspell
(when (executable-find "hunspell")
  (setq-default ispell-program-name "hunspell")
  (setq ispell-really-hunspell t)
  ;;(setq ispell-extra-args '("-a" "-i" "utf-8"))
  (setq ispell-extra-args '("-i" "utf-8"))
  ;;(setq ispell-extra-args nil)
  (setq ispell-local-dictionary-alist (list 
                                       (list "american-hunspell"
                                             "[[:alpha:]]"
                                             "[^[:alpha:]]"
                                             "[']"
                                             t
                                             (list "-d" 
                                                   (expand-file-name "dict/en_US" 
                                                                     use-hunspell))
                                             nil
                                             'utf-8)))
  (setq ispell-dictionary "american-hunspell"))

(global-hl-line-mode t)

(defconst ediff-ignore-similar-regions t)
(defconst ediff-use-last-dir t)
(defconst ediff-diff-options " -b ")

(require 'git-commit-mode)
(require 'git-rebase-mode)
(require 'magit)
  
(global-set-key [(control x) (g)] 'magit-status)
(global-set-key (quote [f9]) 'magit-status)

;; This is here to stop the following error in Magit;
;; "The directory ~/.emacs.d/server is unsafe"
(and (>= emacs-major-version 23)
     (defun server-ensure-safe-dir (dir) "Noop" t))

;(load-theme 'manoj-dark t)
(load-theme 'zenburn t)
;(load-theme 'whiteboard t)

(require 'rich-minority)
(require 'smart-mode-line)

(setq sml/no-confirm-load-theme t)
(sml/setup)

(sml/apply-theme 'dark)
;(sml/apply-theme 'light)
;(sml/apply-theme 'respectful)
;(sml/apply-theme 'automatic)

(require 'powerline)

;(powerline-default-theme)
(powerline-center-theme)
