.emacs.d/emacs.org
** Initial Code Load
Handled in init.el, per Section [[*.emacs.d/init.el][.emacs.d/init.el]].

** Loading TaskJuggler export backend
#+begin_src emacs-lisp
  (require 'ox-taskjuggler)
#+end_src

** Loading Confluence export backend                              :noexport:
#+begin_src emacs-lisp
  ;; (require 'ox-confluence)
#+end_src

** Associate File Extensions to Major Modes
#+begin_src emacs-lisp
  (add-to-list 'auto-mode-alist '("\\.org$" . org-mode)) ;; Specify files to be edited in org-mode
#+end_src

** Set up Auto-Complete for Org-mode                              :noexport:

#+BEGIN_SRC emacs-lisp
  
  ;(require 'org-ac)
  
  ;; Make config suit for you. About the config item, eval the following sexp.
  ;; (customize-group "org-ac")
  
  ;(org-ac/config-default)  
#+END_SRC

** Org-mode Key Bindings
#+begin_src emacs-lisp
  (define-key org-mode-map "\C-h" 'org-delete-backward-char)
  (global-set-key [(control c) (l)] 'org-store-link)
  (global-set-key [(control c) (c)] 'org-capture)
  (global-set-key [(control c) (a)] 'org-agenda)
  (global-set-key [(control c) (b)] 'org-iswitchb) ; Similar to iswitchb, but filters to org buffers
  (global-set-key [(control x) (b)] 'org-iswitchb) ; Override default iswitchb-buffer keys
  
  (setq org-special-ctrl-a/e t) ; Set C-a and C-e to behave specially, 
                                ; considering the headline and not the leading stars, 
                                ; todo keywords, or the trailing tags.
  
  (setq org-special-ctrl-k t) ; When the cursor is at the beginning of a headline, kill
                              ; the entire line and possible the folded subtree below the
                              ; line.
                              ; When in the middle of the headline text, kill the
                              ; headline up to the tags.
                              ; When after the headline text, kill the tags.
#+end_src

** Babel
Set up org-babel to process emacs-lisp, ditaa, Graphviz (dot), and plantuml.

#+begin_src emacs-lisp
  (org-babel-do-load-languages 
   'org-babel-load-languages
   '((emacs-lisp . t)
     (ditaa . t)
     (dot . t)
     (plantuml . t)))
  
  (defun my-org-confirm-babel-evaluate (lang body)
    (and (not (string= lang "ditaa"))      ; don't ask for ditaa
         (not (string= lang "dot"))        ; don't ask for Graphviz (dot)
         (not (string= lang "emacs-lisp")) ; don't ask for emacs lisp   
         (not (string= lang "plantuml")))) ; don't ask for plantuml
  
  (setq org-confirm-babel-evaluate 'my-org-confirm-babel-evaluate)
#+end_src

** Tag Customization
#+begin_src emacs-lisp
  ;; Turn on tag inheritance
  (setq org-use-tag-inheritance t)
  ;; Make headlines with inherited tags show up in tag searches
  (setq org-tags-match-list-sublevels t)
  
  ;; I can fit ~155 characters across the screen; 3 more are needed for the
  ;; ellipsis for folded items, so -150 is about right for the tag position.
  (setq org-tags-column -77)
  ; Use the same settings in the agenda
  ;(setq org-agenda-tags-column org-tags-column)
#+end_src

