.emacs.d/emacs.html
<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> ORG-mode</h2>
<div class="outline-text-2" id="text-12">
</div><div id="outline-container-sec-12-1" class="outline-3">
<h3 id="sec-12-1"><span class="section-number-3">12.1</span> Initial Code Load</h3>
<div class="outline-text-3" id="text-12-1">
<p>
Handled in init.el, per Section <a href="#sec-1-3">.emacs.d/init.el</a>.
</p>
</div>
</div>

<div id="outline-container-sec-12-2" class="outline-3">
<h3 id="sec-12-2"><span class="section-number-3">12.2</span> Loading TaskJuggler export backend</h3>
<div class="outline-text-3" id="text-12-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">require</span> '<span style="color: #BFEBBF;">ox-taskjuggler</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-12-3" class="outline-3">
<h3 id="sec-12-3"><span class="section-number-3">12.3</span> Associate File Extensions to Major Modes</h3>
<div class="outline-text-3" id="text-12-3">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span>add-to-list 'auto-mode-alist '<span style="color: #BFEBBF;">(</span><span style="color: #CC9393;">"\\.org$"</span> . org-mode<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span> <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Specify files to be edited in org-mode</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-12-4" class="outline-3">
<h3 id="sec-12-4"><span class="section-number-3">12.4</span> Org-mode Key Bindings</h3>
<div class="outline-text-3" id="text-12-4">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span>define-key org-mode-map <span style="color: #CC9393;">"\C-h"</span> 'org-delete-backward-char<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>global-set-key <span style="color: #BFEBBF;">[</span><span style="color: #D0BF8F;">(</span>control c<span style="color: #D0BF8F;">)</span> <span style="color: #D0BF8F;">(</span>l<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">]</span> 'org-store-link<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>global-set-key <span style="color: #BFEBBF;">[</span><span style="color: #D0BF8F;">(</span>control c<span style="color: #D0BF8F;">)</span> <span style="color: #D0BF8F;">(</span>c<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">]</span> 'org-capture<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>global-set-key <span style="color: #BFEBBF;">[</span><span style="color: #D0BF8F;">(</span>control c<span style="color: #D0BF8F;">)</span> <span style="color: #D0BF8F;">(</span>a<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">]</span> 'org-agenda<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>global-set-key <span style="color: #BFEBBF;">[</span><span style="color: #D0BF8F;">(</span>control c<span style="color: #D0BF8F;">)</span> <span style="color: #D0BF8F;">(</span>b<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">]</span> 'org-iswitchb<span style="color: #DCDCCC;">)</span> <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">Similar to iswitchb, but filters to org buffers</span>
<span style="color: #DCDCCC;">(</span>global-set-key <span style="color: #BFEBBF;">[</span><span style="color: #D0BF8F;">(</span>control x<span style="color: #D0BF8F;">)</span> <span style="color: #D0BF8F;">(</span>b<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">]</span> 'org-iswitchb<span style="color: #DCDCCC;">)</span> <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">Override default iswitchb-buffer keys</span>

<span style="color: #DCDCCC;">(</span>setq org-special-ctrl-a/e t<span style="color: #DCDCCC;">)</span> <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">Set C-a and C-e to behave specially, </span>
                              <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">considering the headline and not the leading stars, </span>
                              <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">todo keywords, or the trailing tags.</span>

<span style="color: #DCDCCC;">(</span>setq org-special-ctrl-k t<span style="color: #DCDCCC;">)</span> <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">When the cursor is at the beginning of a headline, kill</span>
                            <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">the entire line and possible the folded subtree below the</span>
                            <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">line.</span>
                            <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">When in the middle of the headline text, kill the</span>
                            <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">headline up to the tags.</span>
                            <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">When after the headline text, kill the tags.</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-12-5" class="outline-3">
<h3 id="sec-12-5"><span class="section-number-3">12.5</span> Babel</h3>
<div class="outline-text-3" id="text-12-5">
<p>
Set up org-babel to process emacs-lisp, ditaa, Graphviz (dot), and plantuml.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span>org-babel-do-load-languages 
 'org-babel-load-languages
 '<span style="color: #BFEBBF;">(</span><span style="color: #D0BF8F;">(</span>emacs-lisp . t<span style="color: #D0BF8F;">)</span>
   <span style="color: #D0BF8F;">(</span>ditaa . t<span style="color: #D0BF8F;">)</span>
   <span style="color: #D0BF8F;">(</span>dot . t<span style="color: #D0BF8F;">)</span>
   <span style="color: #D0BF8F;">(</span>plantuml . t<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>

<span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">my-org-confirm-babel-evaluate</span> <span style="color: #BFEBBF;">(</span>lang body<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>and <span style="color: #D0BF8F;">(</span>not <span style="color: #93E0E3;">(</span>string= lang <span style="color: #CC9393;">"ditaa"</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>      <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">don't ask for ditaa</span>
       <span style="color: #D0BF8F;">(</span>not <span style="color: #93E0E3;">(</span>string= lang <span style="color: #CC9393;">"dot"</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>        <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">don't ask for Graphviz (dot)</span>
       <span style="color: #D0BF8F;">(</span>not <span style="color: #93E0E3;">(</span>string= lang <span style="color: #CC9393;">"emacs-lisp"</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span> <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">don't ask for emacs lisp   </span>
       <span style="color: #D0BF8F;">(</span>not <span style="color: #93E0E3;">(</span>string= lang <span style="color: #CC9393;">"plantuml"</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span> <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">don't ask for plantuml</span>

<span style="color: #DCDCCC;">(</span>setq org-confirm-babel-evaluate 'my-org-confirm-babel-evaluate<span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-12-6" class="outline-3">
<h3 id="sec-12-6"><span class="section-number-3">12.6</span> Tag Customization</h3>
<div class="outline-text-3" id="text-12-6">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Turn on tag inheritance</span>
<span style="color: #DCDCCC;">(</span>setq org-use-tag-inheritance t<span style="color: #DCDCCC;">)</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Make headlines with inherited tags show up in tag searches</span>
<span style="color: #DCDCCC;">(</span>setq org-tags-match-list-sublevels t<span style="color: #DCDCCC;">)</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">I can fit ~155 characters across the screen; 3 more are needed for the</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">ellipsis for folded items, so -150 is about right for the tag position.</span>
<span style="color: #DCDCCC;">(</span>setq org-tags-column -77<span style="color: #DCDCCC;">)</span>
<span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">Use the same settings in the agenda</span>
<span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">(setq org-agenda-tags-column org-tags-column)</span>
</pre>
</div>
</div>
</div>
