.emacs.d/emacs.org
** Todo Customization
#+begin_src emacs-lisp
  ;; Automatically change TODO entry to DONE when all children are done:
  ;; http://orgmode.org/manual/Breaking-down-tasks.html#Breaking-down-tasks
  (defun org-summary-todo (n-done n-not-done)
    "Switch entry to DONE when all subentries are done, to TODO otherwise."
    (let (org-log-done org-log-states)   ; turn off logging
      (org-todo (if (= n-not-done 0) "DONE" "TODO"))))
  (add-hook 'org-after-todo-statistics-hook 'org-summary-todo)
#+end_src

** Default TODO List
** Misc Customizations
#+begin_src emacs-lisp
  (setq org-log-done t)
  (add-hook 'org-mode-hook 'turn-on-font-lock)  ;Org buffers only
  (setq org-agenda-show-all-dates t)
  
  (setq org-agenda-archives-mode nil)
  (setq org-agenda-skip-comment-trees nil)
  (setq org-agenda-skip-function nil)

  (add-hook 'org-mode-hook 
            'turn-on-visual-line-mode) ;Wrap lines at window edge
#+end_src

** Fonts
*** Column View
Ensure that column view uses fixed width font.
#+begin_src emacs-lisp
  (when (fboundp 'set-face-attribute)
      ;; Make sure that a fixed-width face is used when we have a column
      ;; table.
      (set-face-attribute 'org-column nil
                          :height (face-attribute 'default :height)
                          :family (face-attribute 'default :family)))
#+end_src

*** Tables
Ensure that tables use fixed-pitch fonts
#+begin_src emacs-lisp
  (when (fboundp 'set-face-attribute)
      ;; Make sure that a fixed-width face is used when we have a column
      ;; table.
      (set-face-attribute 'org-table nil
                          :height (face-attribute 'default :height)
                          :family (face-attribute 'default :family)))
#+end_src

