.emacs.d/emacs.html

<div id="outline-container-sec-12-7" class="outline-3">
<h3 id="sec-12-7"><span class="section-number-3">12.7</span> Todo Customization</h3>
<div class="outline-text-3" id="text-12-7">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Automatically change TODO entry to DONE when all children are done:</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">http://orgmode.org/manual/Breaking-down-tasks.html#Breaking-down-tasks</span>
<span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">org-summary-todo</span> <span style="color: #BFEBBF;">(</span>n-done n-not-done<span style="color: #BFEBBF;">)</span>
  <span style="color: #9FC59F;">"Switch entry to DONE when all subentries are done, to TODO otherwise."</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">let</span> <span style="color: #D0BF8F;">(</span>org-log-done org-log-states<span style="color: #D0BF8F;">)</span>   <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">turn off logging</span>
    <span style="color: #D0BF8F;">(</span>org-todo <span style="color: #93E0E3;">(</span><span style="color: #F0DFAF; font-weight: bold;">if</span> <span style="color: #9FC59F;">(</span>= n-not-done 0<span style="color: #9FC59F;">)</span> <span style="color: #CC9393;">"DONE"</span> <span style="color: #CC9393;">"TODO"</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>add-hook 'org-after-todo-statistics-hook 'org-summary-todo<span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-12-8" class="outline-3">
<h3 id="sec-12-8"><span class="section-number-3">12.8</span> Default TODO List</h3>
</div>
<div id="outline-container-sec-12-9" class="outline-3">
<h3 id="sec-12-9"><span class="section-number-3">12.9</span> Misc Customizations</h3>
<div class="outline-text-3" id="text-12-9">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span>setq org-log-done t<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>add-hook 'org-mode-hook 'turn-on-font-lock<span style="color: #DCDCCC;">)</span>  <span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">Org buffers only</span>
<span style="color: #DCDCCC;">(</span>setq org-agenda-show-all-dates t<span style="color: #DCDCCC;">)</span>

<span style="color: #DCDCCC;">(</span>setq org-agenda-archives-mode nil<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>setq org-agenda-skip-comment-trees nil<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>setq org-agenda-skip-function nil<span style="color: #DCDCCC;">)</span>

<span style="color: #DCDCCC;">(</span>add-hook 'org-mode-hook 
          'turn-on-visual-line-mode<span style="color: #DCDCCC;">)</span> <span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">Wrap lines at window edge</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-12-10" class="outline-3">
<h3 id="sec-12-10"><span class="section-number-3">12.10</span> Fonts</h3>
<div class="outline-text-3" id="text-12-10">
</div><div id="outline-container-sec-12-10-1" class="outline-4">
<h4 id="sec-12-10-1"><span class="section-number-4">12.10.1</span> Column View</h4>
<div class="outline-text-4" id="text-12-10-1">
<p>
Ensure that column view uses fixed width font.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">when</span> <span style="color: #BFEBBF;">(</span>fboundp 'set-face-attribute<span style="color: #BFEBBF;">)</span>
    <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Make sure that a fixed-width face is used when we have a column</span>
    <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">table.</span>
    <span style="color: #BFEBBF;">(</span>set-face-attribute 'org-column nil
                        <span style="color: #DCDCCC; font-weight: bold;">:height</span> <span style="color: #D0BF8F;">(</span>face-attribute 'default <span style="color: #DCDCCC; font-weight: bold;">:height</span><span style="color: #D0BF8F;">)</span>
                        <span style="color: #DCDCCC; font-weight: bold;">:family</span> <span style="color: #D0BF8F;">(</span>face-attribute 'default <span style="color: #DCDCCC; font-weight: bold;">:family</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-12-10-2" class="outline-4">
<h4 id="sec-12-10-2"><span class="section-number-4">12.10.2</span> Tables</h4>
<div class="outline-text-4" id="text-12-10-2">
<p>
Ensure that tables use fixed-pitch fonts
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">when</span> <span style="color: #BFEBBF;">(</span>fboundp 'set-face-attribute<span style="color: #BFEBBF;">)</span>
    <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Make sure that a fixed-width face is used when we have a column</span>
    <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">table.</span>
    <span style="color: #BFEBBF;">(</span>set-face-attribute 'org-table nil
                        <span style="color: #DCDCCC; font-weight: bold;">:height</span> <span style="color: #D0BF8F;">(</span>face-attribute 'default <span style="color: #DCDCCC; font-weight: bold;">:height</span><span style="color: #D0BF8F;">)</span>
                        <span style="color: #DCDCCC; font-weight: bold;">:family</span> <span style="color: #D0BF8F;">(</span>face-attribute 'default <span style="color: #DCDCCC; font-weight: bold;">:family</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
</div>
