.emacs.d/emacs.org
** Spelling
Set up Hunspell and flyspell for org-mode.  But only spellcheck in code blocks.

Flyspell maps the following keys;

- C-. flyspell-auto-correct-word

#+begin_src emacs-lisp
  ;;(add-hook 'org-mode-hook 'flyspell-prog-mode 'append)
   
  ;;(setq flyspell-issue-message-flag nil) ; for speed apparently
  
  ;; some extra flyspell delayed command
  ;; (mapcar 'flyspell-delay-command      
  ;;      '(scroll-up1 scroll-down1))
  
  (global-unset-key [(control /)]) ;; Remove the mapping of undo.  Reused in flyspell.
  (global-unset-key [(control \,)]) ;; Remove the mapping of undo.  Reused in flyspell.
  (global-set-key [(f8)] 'flyspell-mode)
    
  (defun flyspell-check-next-highlighted-word ()
    "Custom function to spell check next highlighted word"
   (interactive)
    (flyspell-goto-next-error))
                                      
  (add-hook 'flyspell-mode-hook (lambda ()
                                  (if flyspell-mode
                                      (progn
                                        (flyspell-buffer)
                                        (local-set-key [(control /)] 
                                                       'flyspell-check-next-highlighted-word)
                                        (local-set-key [(control \,)] 
                                                       'flyspell-check-previous-highlighted-word))
                                    (progn
                                      (local-unset-key [(control /)])
                                      (local-unset-key [(control \,)])))))
#+end_src

** Footnotes
Enable automatic renumbering of footnotes
#+begin_src emacs-lisp
  ;;(setq org-footnote-auto-adjust t) ;Or place the following in the .org file 
                                      ;#+STARTUP: fnadjust
#+end_src

** Document Generation
*** Custom LaTeX title page

** Links
#+begin_src emacs-lisp
  (setq org-id-link-to-org-use-id t)
#+end_src

** Fontify source blocks in Latex
#+BEGIN_SRC emacs-lisp
 (require 'ox-latex)
 ;(setq org-latex-listings t)

 ;(add-to-list 'org-latex-packages-alist '("" "listings"))
#+END_SRC

** Syntax highlight source blocks in the org buffer
#+BEGIN_SRC emacs-lisp
(setq org-src-fontify-natively t)
#+END_SRC

** Set when Deadlines appear in Agenda view
#+BEGIN_SRC emacs-lisp
(setq org-deadline-warning-days 30)
#+END_SRC

** Delete the ID when cloning a subtree
#+BEGIN_SRC emacs-lisp
(setq org-clone-delete-id t)
#+END_SRC

** Allow alphabetical lists
#+BEGIN_SRC emacs-lisp
(setq org-list-allow-alphabetical t)
#+END_SRC

** Log working time into a LOGBOOK drawer
#+BEGIN_SRC emacs-lisp
(setq org-clock-into-drawer t)
#+END_SRC

