.emacs.d/emacs.html

<div id="outline-container-sec-12-11" class="outline-3">
<h3 id="sec-12-11"><span class="section-number-3">12.11</span> Spelling</h3>
<div class="outline-text-3" id="text-12-11">
<p>
Set up Hunspell and flyspell for org-mode.  But only spellcheck in code blocks.
</p>

<p>
Flyspell maps the following keys;
</p>

<ul class="org-ul">
<li>C-. flyspell-auto-correct-word
</li>
</ul>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #5F7F5F;">;;</span><span style="color: #7F9F7F;">(add-hook 'org-mode-hook 'flyspell-prog-mode 'append)</span>

<span style="color: #5F7F5F;">;;</span><span style="color: #7F9F7F;">(setq flyspell-issue-message-flag nil) ; for speed apparently</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">some extra flyspell delayed command</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">(mapcar 'flyspell-delay-command      </span>
<span style="color: #5F7F5F;">;;      </span><span style="color: #7F9F7F;">'(scroll-up1 scroll-down1))</span>

<span style="color: #DCDCCC;">(</span>global-unset-key <span style="color: #BFEBBF;">[</span><span style="color: #D0BF8F;">(</span>control /<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">]</span><span style="color: #DCDCCC;">)</span> <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Remove the mapping of undo.  Reused in flyspell.</span>
<span style="color: #DCDCCC;">(</span>global-unset-key <span style="color: #BFEBBF;">[</span><span style="color: #D0BF8F;">(</span>control \,<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">]</span><span style="color: #DCDCCC;">)</span> <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Remove the mapping of undo.  Reused in flyspell.</span>
<span style="color: #DCDCCC;">(</span>global-set-key <span style="color: #BFEBBF;">[</span><span style="color: #D0BF8F;">(</span>f8<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">]</span> 'flyspell-mode<span style="color: #DCDCCC;">)</span>

<span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">flyspell-check-next-highlighted-word</span> <span style="color: #BFEBBF;">()</span>
  <span style="color: #9FC59F;">"Custom function to spell check next highlighted word"</span>
 <span style="color: #BFEBBF;">(</span>interactive<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>flyspell-goto-next-error<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>

<span style="color: #DCDCCC;">(</span>add-hook 'flyspell-mode-hook <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">lambda</span> <span style="color: #D0BF8F;">()</span>
                                <span style="color: #D0BF8F;">(</span><span style="color: #F0DFAF; font-weight: bold;">if</span> flyspell-mode
                                    <span style="color: #93E0E3;">(</span><span style="color: #F0DFAF; font-weight: bold;">progn</span>
                                      <span style="color: #9FC59F;">(</span>flyspell-buffer<span style="color: #9FC59F;">)</span>
                                      <span style="color: #9FC59F;">(</span>local-set-key <span style="color: #94BFF3;">[</span><span style="color: #E0CF9F;">(</span>control /<span style="color: #E0CF9F;">)</span><span style="color: #94BFF3;">]</span> 
                                                     'flyspell-check-next-highlighted-word<span style="color: #9FC59F;">)</span>
                                      <span style="color: #9FC59F;">(</span>local-set-key <span style="color: #94BFF3;">[</span><span style="color: #E0CF9F;">(</span>control \,<span style="color: #E0CF9F;">)</span><span style="color: #94BFF3;">]</span> 
                                                     'flyspell-check-previous-highlighted-word<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span>
                                  <span style="color: #93E0E3;">(</span><span style="color: #F0DFAF; font-weight: bold;">progn</span>
                                    <span style="color: #9FC59F;">(</span>local-unset-key <span style="color: #94BFF3;">[</span><span style="color: #E0CF9F;">(</span>control /<span style="color: #E0CF9F;">)</span><span style="color: #94BFF3;">]</span><span style="color: #9FC59F;">)</span>
                                    <span style="color: #9FC59F;">(</span>local-unset-key <span style="color: #94BFF3;">[</span><span style="color: #E0CF9F;">(</span>control \,<span style="color: #E0CF9F;">)</span><span style="color: #94BFF3;">]</span><span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-12-12" class="outline-3">
<h3 id="sec-12-12"><span class="section-number-3">12.12</span> Document Generation</h3>
<div class="outline-text-3" id="text-12-12">
</div><div id="outline-container-sec-12-12-1" class="outline-4">
<h4 id="sec-12-12-1"><span class="section-number-4">12.12.1</span> Custom LaTeX title page</h4>
</div>
</div>

<div id="outline-container-sec-12-13" class="outline-3">
<h3 id="sec-12-13"><span class="section-number-3">12.13</span> Links</h3>
<div class="outline-text-3" id="text-12-13">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span>setq org-id-link-to-org-use-id t<span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-12-14" class="outline-3">
<h3 id="sec-12-14"><span class="section-number-3">12.14</span> Fontify source blocks in Latex</h3>
<div class="outline-text-3" id="text-12-14">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span>setq org-latex-listings t<span style="color: #DCDCCC;">)</span>

<span style="color: #DCDCCC;">(</span>add-to-list 'org-latex-packages-alist '<span style="color: #BFEBBF;">(</span><span style="color: #CC9393;">""</span> <span style="color: #CC9393;">"listings"</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-12-15" class="outline-3">
<h3 id="sec-12-15"><span class="section-number-3">12.15</span> Syntax highlight source blocks in the org buffer</h3>
<div class="outline-text-3" id="text-12-15">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span>setq org-src-fontify-natively t<span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-12-16" class="outline-3">
<h3 id="sec-12-16"><span class="section-number-3">12.16</span> Set when Deadlines appear in Agenda view</h3>
<div class="outline-text-3" id="text-12-16">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span>setq org-deadline-warning-days 30<span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-12-17" class="outline-3">
<h3 id="sec-12-17"><span class="section-number-3">12.17</span> Delete the ID when cloning a subtree</h3>
<div class="outline-text-3" id="text-12-17">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span>setq org-clone-delete-id t<span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-12-18" class="outline-3">
<h3 id="sec-12-18"><span class="section-number-3">12.18</span> Allow alphabetical lists</h3>
<div class="outline-text-3" id="text-12-18">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span>setq org-list-allow-alphabetical t<span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-12-19" class="outline-3">
<h3 id="sec-12-19"><span class="section-number-3">12.19</span> Log working time into a LOGBOOK drawer</h3>
<div class="outline-text-3" id="text-12-19">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span>setq org-clock-into-drawer t<span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
