.emacs.d/emacs.el

;;(add-hook 'org-mode-hook 'flyspell-prog-mode 'append)
 
;;(setq flyspell-issue-message-flag nil) ; for speed apparently

;; some extra flyspell delayed command
;; (mapcar 'flyspell-delay-command      
;;      '(scroll-up1 scroll-down1))

(global-unset-key [(control /)]) ;; Remove the mapping of undo.  Reused in flyspell.
(global-unset-key [(control \,)]) ;; Remove the mapping of undo.  Reused in flyspell.
(global-set-key [(f8)] 'flyspell-mode)
  
(defun flyspell-check-next-highlighted-word ()
  "Custom function to spell check next highlighted word"
 (interactive)
  (flyspell-goto-next-error))
                                    
(add-hook 'flyspell-mode-hook (lambda ()
                                (if flyspell-mode
                                    (progn
                                      (flyspell-buffer)
                                      (local-set-key [(control /)] 
                                                     'flyspell-check-next-highlighted-word)
                                      (local-set-key [(control \,)] 
                                                     'flyspell-check-previous-highlighted-word))
                                  (progn
                                    (local-unset-key [(control /)])
                                    (local-unset-key [(control \,)])))))

;;(setq org-footnote-auto-adjust t) ;Or place the following in the .org file 
                                    ;#+STARTUP: fnadjust

(setq org-id-link-to-org-use-id t)

(setq org-latex-listings t)

(add-to-list 'org-latex-packages-alist '("" "listings"))

(setq org-src-fontify-natively t)

(setq org-deadline-warning-days 30)

(setq org-clone-delete-id t)

(setq org-list-allow-alphabetical t)

(setq org-clock-into-drawer t)
