.emacs.d/emacs.html

<div id="outline-container-sec-12-20" class="outline-3">
<h3 id="sec-12-20"><span class="section-number-3">12.20</span> Function to return just the date of the most recent commit</h3>
<div class="outline-text-3" id="text-12-20">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">vc-git-print-log-date-only</span> <span style="color: #BFEBBF;">(</span>files buffer<span style="color: #BFEBBF;">)</span>
  <span style="color: #9FC59F;">"Get the date of the most recent commit associated with FILES."</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">let</span> <span style="color: #D0BF8F;">(</span><span style="color: #93E0E3;">(</span>coding-system-for-read vc-git-commits-coding-system<span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
    <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">`</span><span style="color: #7F9F7F;">vc-do-command</span><span style="color: #7F9F7F;">' creates the buffer, but we need it before running</span>
    <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">the command.</span>
    <span style="color: #D0BF8F;">(</span>vc-setup-buffer buffer<span style="color: #D0BF8F;">)</span>
    <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">If the buffer exists from a previous invocation it might be</span>
    <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">read-only.</span>
    <span style="color: #D0BF8F;">(</span><span style="color: #F0DFAF; font-weight: bold;">let</span> <span style="color: #93E0E3;">(</span><span style="color: #9FC59F;">(</span>inhibit-read-only t<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span>
      <span style="color: #93E0E3;">(</span><span style="color: #F0DFAF; font-weight: bold;">with-current-buffer</span>
          buffer
        <span style="color: #9FC59F;">(</span>apply 'vc-git-command buffer
               'async files
               <span style="color: #94BFF3;">(</span>append
                '<span style="color: #E0CF9F;">(</span><span style="color: #CC9393;">"log"</span> <span style="color: #CC9393;">"--no-color"</span><span style="color: #E0CF9F;">)</span>
                '<span style="color: #E0CF9F;">(</span><span style="color: #CC9393;">"--pretty=format:%cd"</span> <span style="color: #CC9393;">"-1"</span><span style="color: #E0CF9F;">)</span>
                '<span style="color: #E0CF9F;">(</span><span style="color: #CC9393;">"--"</span><span style="color: #E0CF9F;">)</span><span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>

<span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">return-date-of-recent-commit</span> <span style="color: #BFEBBF;">(</span>buffer<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">require</span> '<span style="color: #BFEBBF;">vc</span><span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">when</span> <span style="color: #D0BF8F;">(</span>vc-find-backend-function <span style="color: #93E0E3;">(</span>vc-backend <span style="color: #9FC59F;">(</span>buffer-file-name buffer<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span>
                                  'print-log-date-only<span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span><span style="color: #F0DFAF; font-weight: bold;">let</span> <span style="color: #93E0E3;">(</span><span style="color: #9FC59F;">(</span>limit -1<span style="color: #9FC59F;">)</span>
          <span style="color: #9FC59F;">(</span>vc-fileset nil<span style="color: #9FC59F;">)</span>
          <span style="color: #9FC59F;">(</span>backend nil<span style="color: #9FC59F;">)</span>
          <span style="color: #9FC59F;">(</span>files nil<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span>
      <span style="color: #93E0E3;">(</span><span style="color: #F0DFAF; font-weight: bold;">with-current-buffer</span> buffer
        <span style="color: #9FC59F;">(</span>setq vc-fileset <span style="color: #94BFF3;">(</span>vc-deduce-fileset t<span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span> <span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">FIXME: Why t? --Stef</span>
        <span style="color: #9FC59F;">(</span>setq backend <span style="color: #94BFF3;">(</span>car vc-fileset<span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span>
        <span style="color: #9FC59F;">(</span>setq files <span style="color: #94BFF3;">(</span>cadr vc-fileset<span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span>
      <span style="color: #93E0E3;">(</span><span style="color: #F0DFAF; font-weight: bold;">with-temp-buffer</span> 
        <span style="color: #9FC59F;">(</span><span style="color: #F0DFAF; font-weight: bold;">let</span> <span style="color: #94BFF3;">(</span><span style="color: #E0CF9F;">(</span>status <span style="color: #8FB28F;">(</span>vc-call-backend backend
                                       'print-log-date-only
                                       files
                                       <span style="color: #6CA0A3;">(</span>current-buffer<span style="color: #6CA0A3;">)</span><span style="color: #8FB28F;">)</span><span style="color: #E0CF9F;">)</span><span style="color: #94BFF3;">)</span>
          <span style="color: #94BFF3;">(</span><span style="color: #F0DFAF; font-weight: bold;">when</span> <span style="color: #E0CF9F;">(</span>and <span style="color: #8FB28F;">(</span>processp status<span style="color: #8FB28F;">)</span> <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Make sure status is a process</span>
                     <span style="color: #8FB28F;">(</span>= 0 <span style="color: #6CA0A3;">(</span>process-exit-status status<span style="color: #6CA0A3;">)</span><span style="color: #8FB28F;">)</span><span style="color: #E0CF9F;">)</span> <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">And that it has not terminated</span>
            <span style="color: #E0CF9F;">(</span><span style="color: #F0DFAF; font-weight: bold;">while</span> <span style="color: #8FB28F;">(</span>not <span style="color: #6CA0A3;">(</span>eq 'exit <span style="color: #DCDCCC;">(</span>process-status status<span style="color: #DCDCCC;">)</span><span style="color: #6CA0A3;">)</span><span style="color: #8FB28F;">)</span> <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Loop and sleep until complete</span>
              <span style="color: #8FB28F;">(</span>sit-for 1 t<span style="color: #8FB28F;">)</span><span style="color: #E0CF9F;">)</span><span style="color: #94BFF3;">)</span>
          <span style="color: #94BFF3;">(</span>buffer-string<span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-12-21" class="outline-3">
<h3 id="sec-12-21"><span class="section-number-3">12.21</span> Hide Leading Stars</h3>
<div class="outline-text-3" id="text-12-21">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span>setq org-hide-leading-stars t<span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-12-22" class="outline-3">
<h3 id="sec-12-22"><span class="section-number-3">12.22</span> Org-Reveal</h3>
<div class="outline-text-3" id="text-12-22">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span>setq org-reveal-theme <span style="color: #CC9393;">"night"</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
</div>
