.emacs.d/emacs.el

(defun vc-git-print-log-date-only (files buffer)
  "Get the date of the most recent commit associated with FILES."
  (let ((coding-system-for-read vc-git-commits-coding-system))
    ;; `vc-do-command' creates the buffer, but we need it before running
    ;; the command.
    (vc-setup-buffer buffer)
    ;; If the buffer exists from a previous invocation it might be
    ;; read-only.
    (let ((inhibit-read-only t))
      (with-current-buffer
          buffer
        (apply 'vc-git-command buffer
               'async files
               (append
                '("log" "--no-color")
                '("--pretty=format:%cd" "-1")
                '("--")))))))

(defun return-date-of-recent-commit (buffer)
  (require 'vc)
  (when (vc-find-backend-function (vc-backend (buffer-file-name buffer))
                                  'print-log-date-only)
    (let ((limit -1)
          (vc-fileset nil)
          (backend nil)
          (files nil))
      (with-current-buffer buffer
        (setq vc-fileset (vc-deduce-fileset t)) ;FIXME: Why t? --Stef
        (setq backend (car vc-fileset))
        (setq files (cadr vc-fileset)))
      (with-temp-buffer 
        (let ((status (vc-call-backend backend
                                       'print-log-date-only
                                       files
                                       (current-buffer))))
          (when (and (processp status) ;; Make sure status is a process
                     (= 0 (process-exit-status status))) ;; And that it has not terminated
            (while (not (eq 'exit (process-status status))) ;; Loop and sleep until complete
              (sit-for 1 t)))
          (buffer-string))))))

(setq org-hide-leading-stars t)

(setq org-reveal-theme "night")
