.emacs.d/emacs.html
<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> Org Publishing</h2>
<div class="outline-text-2" id="text-13">
</div><div id="outline-container-sec-13-1" class="outline-3">
<h3 id="sec-13-1"><span class="section-number-3">13.1</span> Jekyll configuration</h3>
<div class="outline-text-3" id="text-13-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span>setq org-publish-project-alist 
      '<span style="color: #BFEBBF;">(</span>
        <span style="color: #D0BF8F;">(</span><span style="color: #CC9393;">"org-balooga"</span>
         <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Path to your org files.</span>
         <span style="color: #DCDCCC; font-weight: bold;">:base-directory</span> <span style="color: #CC9393;">"~/blog/org/"</span>
         <span style="color: #DCDCCC; font-weight: bold;">:base-extension</span> <span style="color: #CC9393;">"org"</span>

         <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Path to your Jekyll project.</span>
         <span style="color: #DCDCCC; font-weight: bold;">:publishing-directory</span> <span style="color: #CC9393;">"~/blog/balooga/"</span>
         <span style="color: #DCDCCC; font-weight: bold;">:recursive</span> t
         <span style="color: #DCDCCC; font-weight: bold;">:publishing-function</span> org-html-publish-to-html
         <span style="color: #DCDCCC; font-weight: bold;">:headline-levels</span> 4 
         <span style="color: #DCDCCC; font-weight: bold;">:html-extension</span> <span style="color: #CC9393;">"html"</span>
         <span style="color: #DCDCCC; font-weight: bold;">:body-only</span> t <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Only export section between &lt;body&gt; &lt;/body&gt;</span>
         <span style="color: #D0BF8F;">)</span>


        <span style="color: #D0BF8F;">(</span><span style="color: #CC9393;">"org-static-blaooga"</span>
         <span style="color: #DCDCCC; font-weight: bold;">:base-directory</span> <span style="color: #CC9393;">"~/blog/org/"</span>
         <span style="color: #DCDCCC; font-weight: bold;">:base-extension</span> <span style="color: #CC9393;">"css</span><span style="color: #CC9393; font-weight: bold;">\\</span><span style="color: #CC9393; font-weight: bold;">|</span><span style="color: #CC9393;">js</span><span style="color: #CC9393; font-weight: bold;">\\</span><span style="color: #CC9393; font-weight: bold;">|</span><span style="color: #CC9393;">png</span><span style="color: #CC9393; font-weight: bold;">\\</span><span style="color: #CC9393; font-weight: bold;">|</span><span style="color: #CC9393;">jpg</span><span style="color: #CC9393; font-weight: bold;">\\</span><span style="color: #CC9393; font-weight: bold;">|</span><span style="color: #CC9393;">gif</span><span style="color: #CC9393; font-weight: bold;">\\</span><span style="color: #CC9393; font-weight: bold;">|</span><span style="color: #CC9393;">pdf</span><span style="color: #CC9393; font-weight: bold;">\\</span><span style="color: #CC9393; font-weight: bold;">|</span><span style="color: #CC9393;">mp3</span><span style="color: #CC9393; font-weight: bold;">\\</span><span style="color: #CC9393; font-weight: bold;">|</span><span style="color: #CC9393;">ogg</span><span style="color: #CC9393; font-weight: bold;">\\</span><span style="color: #CC9393; font-weight: bold;">|</span><span style="color: #CC9393;">swf</span><span style="color: #CC9393; font-weight: bold;">\\</span><span style="color: #CC9393; font-weight: bold;">|</span><span style="color: #CC9393;">php"</span>
         <span style="color: #DCDCCC; font-weight: bold;">:publishing-directory</span> <span style="color: #CC9393;">"~/blog/"</span>
         <span style="color: #DCDCCC; font-weight: bold;">:recursive</span> t
         <span style="color: #DCDCCC; font-weight: bold;">:publishing-function</span> org-publish-attachment<span style="color: #D0BF8F;">)</span>

        <span style="color: #D0BF8F;">(</span><span style="color: #CC9393;">"balooga"</span> <span style="color: #DCDCCC; font-weight: bold;">:components</span> <span style="color: #93E0E3;">(</span><span style="color: #CC9393;">"org-balooga"</span> <span style="color: #CC9393;">"org-static-balooga"</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>

        <span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-14" class="outline-2">
<h2 id="sec-14"><span class="section-number-2">14</span> Slime</h2>
<div class="outline-text-2" id="text-14">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Setup autoloads</span>
<span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">require</span> '<span style="color: #BFEBBF;">slime-autoloads</span><span style="color: #DCDCCC;">)</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Set your lisp system and some contribs</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">(setq inferior-lisp-program (concat "~/lw-console.exe -init "</span>
<span style="color: #5F7F5F;">;;                                     </span><span style="color: #7F9F7F;">use-home</span>
<span style="color: #5F7F5F;">;;                                     </span><span style="color: #7F9F7F;">"/lispworks.lisp"))</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">(setf inferior-lisp-program (concat "/Applications/Clozure CL.app/Contents/MacOS/dx86cl64 " "-K utf-8 -tty"))</span>
<span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">(setf inferior-lisp-program (concat "/Applications/Clozure CL.app/Contents/MacOS/dx86cl64"))</span>
<span style="color: #DCDCCC;">(</span>setf inferior-lisp-program <span style="color: #CC9393;">"/usr/local/bin/sbcl"</span><span style="color: #DCDCCC;">)</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">(file-exists-p (concat "/Applications/Clozure CL.app/Contents/MacOS/dx86cl64"))</span>
<span style="color: #DCDCCC;">(</span>setf slime-net-coding-system 'utf-8-unix<span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>setf slime-contribs '<span style="color: #BFEBBF;">(</span>slime-fancy<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-15" class="outline-2">
<h2 id="sec-15"><span class="section-number-2">15</span> Startup Display</h2>
<div class="outline-text-2" id="text-15">
</div><div id="outline-container-sec-15-1" class="outline-3">
<h3 id="sec-15-1"><span class="section-number-3">15.1</span> Maximize the Emacs Window on Startup</h3>
<div class="outline-text-3" id="text-15-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Bound to f11 in Emacs 24.4</span>
<span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">when</span> <span style="color: #BFEBBF;">(</span>and <span style="color: #D0BF8F;">(</span>&gt;= emacs-major-version 24<span style="color: #D0BF8F;">)</span>
           <span style="color: #D0BF8F;">(</span>&gt;= emacs-minor-version 4<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>toggle-frame-fullscreen<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-15-2" class="outline-3">
<h3 id="sec-15-2"><span class="section-number-3">15.2</span> Open a directory screen</h3>
<div class="outline-text-3" id="text-15-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #5F7F5F;">;;;;    </span><span style="color: #7F9F7F;">Start Directory</span>
<span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">(find-file use-git-repo)</span>
<span style="color: #DCDCCC;">(</span>find-file use-home<span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-16" class="outline-2">
<h2 id="sec-16"><span class="section-number-2">16</span> End timing .emacs load time</h2>
<div class="outline-text-2" id="text-16">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defvar</span> <span style="color: #DFAF8F;">*emacs-load-end*</span> <span style="color: #BFEBBF;">(</span>current-time<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>

<span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">dot-load-time</span> <span style="color: #BFEBBF;">()</span>
  <span style="color: #BFEBBF;">(</span>interactive<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>message <span style="color: #CC9393;">".emacs loaded in %ds"</span> 
           <span style="color: #D0BF8F;">(</span><span style="color: #F0DFAF; font-weight: bold;">destructuring-bind</span> <span style="color: #93E0E3;">(</span>hi lo ms ps<span style="color: #93E0E3;">)</span> *emacs-load-end*
             <span style="color: #93E0E3;">(</span>- <span style="color: #9FC59F;">(</span>+ hi lo<span style="color: #9FC59F;">)</span>
                <span style="color: #9FC59F;">(</span>+ <span style="color: #94BFF3;">(</span>first *emacs-load-start*<span style="color: #94BFF3;">)</span> <span style="color: #94BFF3;">(</span>second *emacs-load-start*<span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">[2014-10-07 Tue]</span></span></p>
<p class="author">Author: Luke Crook</p>
<p class="email">Email: <a href="mailto:luke@balooga.com">luke@balooga.com</a></p>
<p class="date">Created: 2014-10-07 Tue 03:49</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
