.emacs.d/emacs.el

(setq org-publish-project-alist 
      '(
        ("org-balooga"
         ;; Path to your org files.
         :base-directory "~/blog/org/"
         :base-extension "org"

         ;; Path to your Jekyll project.
         :publishing-directory "~/blog/balooga/"
         :recursive t
         :publishing-function org-html-publish-to-html
         :headline-levels 4 
         :html-extension "html"
         :body-only t ;; Only export section between <body> </body>
         )


        ("org-static-blaooga"
         :base-directory "~/blog/org/"
         :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf\\|php"
         :publishing-directory "~/blog/"
         :recursive t
         :publishing-function org-publish-attachment)

        ("balooga" :components ("org-balooga" "org-static-balooga"))

        ))

;; Setup autoloads
(require 'slime-autoloads)

;; Set your lisp system and some contribs
;; (setq inferior-lisp-program (concat "~/lw-console.exe -init "
;;                                     use-home
;;                                     "/lispworks.lisp"))
;; (setf inferior-lisp-program (concat "/Applications/Clozure CL.app/Contents/MacOS/dx86cl64 " "-K utf-8 -tty"))
;(setf inferior-lisp-program (concat "/Applications/Clozure CL.app/Contents/MacOS/dx86cl64"))
(setf inferior-lisp-program "/usr/local/bin/sbcl")
;; (file-exists-p (concat "/Applications/Clozure CL.app/Contents/MacOS/dx86cl64"))
(setf slime-net-coding-system 'utf-8-unix)
(setf slime-contribs '(slime-fancy))

;; Bound to f11 in Emacs 24.4
(when (and (>= emacs-major-version 24)
           (>= emacs-minor-version 4))
  (toggle-frame-fullscreen))

;;;;    Start Directory
;(find-file use-git-repo)
(find-file use-home)

(setq inhibit-splash-screen t)

;; Don't use messages that you don't read
(setq initial-scratch-message nil)
(setq inhibit-startup-message t)

(setq initial-major-mode 'org-mode)
;; Don't let Emacs hurt your ears when t
(setq visible-bell t)

(setq display-time-24hr-format t)
(setq display-time-day-and-date t)

(defvar *emacs-load-end* (current-time))

(defun dot-load-time ()
  (interactive)
  (message ".emacs loaded in %ds" 
           (destructuring-bind (hi lo ms ps) *emacs-load-end*
             (- (+ hi lo)
                (+ (first *emacs-load-start*) (second *emacs-load-start*))))))
